import trak1 from "../../assets/track1.webp"
import descTr1 from "../../assets/desctr1.png"
import trak2 from "../../assets/trak2.webp"
import descTr2 from "../../assets/descTr2.png"
import trak3 from "../../assets/trak3.webp"
import trak4 from "../../assets/trak4.webp"
import trak5 from "../../assets/trak5.webp"
import trak6 from "../../assets/trak6.webp"
import trak7 from "../../assets/trak7.webp"
import descTr3 from "../../assets/descTr3.jpg"
import trak8 from "../../assets/trak8.webp"
import trak9 from "../../assets/trak9.webp"
import trak10 from "../../assets/trak10.webp"
import descTr4 from "../../assets/descTr4.png"
import trak11 from "../../assets/trak11.webp"
import descTr5 from "../../assets/descTr5.jpg"
import trak12 from "../../assets/trak12.webp"
import trak13 from "../../assets/trak13.webp"
import trak14 from "../../assets/trak14.webp"
import trak15 from "../../assets/trak15.webp"
import trak16 from "../../assets/trak16.webp"
import trak17 from "../../assets/trak17.webp"
import trak18 from "../../assets/trak18.webp"
import trak19 from "../../assets/trak19.webp"
import trak20 from "../../assets/trak20.webp"
import trak21 from "../../assets/trak12.webp"
import trak22 from "../../assets/trak22.webp"
import trak24 from "../../assets/trak24.webp"
import trak25 from "../../assets/trak25.webp"
import trak26 from "../../assets/trak26.webp"
import trak27 from "../../assets/trak27.webp"

import cartImg1 from "../../assets/cartImg1.webp"
import cartImg2 from "../../assets/cartImg2.webp"
import cartImg3 from "../../assets/cartImg3.png"
import cartImg4 from "../../assets/cartImg4.webp"
import cartImg5 from "../../assets/cartImg5.webp"
import cartImg6 from "../../assets/cartImg6.webp"
import cartImg7 from "../../assets/cartImg8.webp"
import cartImg8 from "../../assets/cartImg9.png"
import cartImg9 from "../../assets/cartImg10.webp"
import cartImg11 from "../../assets/cartImg12.png"


interface workingFeatureItems {
  workingFeaturesLabel?: string;
  workingFeaturesDesc: string
}

interface featuresItems {
  featuresLAbel?: string;
  featuresdesc: string;
}

interface trakItems {
  id: number;
  title: string;
  img: string;
  price: string;
  mass?: string;
  formula?: string;
  descKey: string[];
  descValue: string[];
  descImg?: string;
  paramLabel: string;
  parametrs: string[];
}

export const catalogConfig: Record<string, { 
  slug: string;
  title: string; 
  cartImg: string;
  filters: any[];
  content?: {
    intro: string;
    assortment: string;
    assortmentdesc1: string;
    assortmentdesc2: string;
    assortmentdesc3?: string;
    assortmentdesc2features?: string[];
    brand?: string;
    brands: string[],
    featuresLabel? :string;
    features: featuresItems[];
    applicationLabel: string;
    applicationDesc: string;
    workingTitle: string;
    workingfeatures: workingFeatureItems[];
    equipmentTItle: string;
    equipmentdesc: string;
  };
  trak: trakItems[];
}> = {
  "Curtain-trucks": {
    slug: "Curtain-trucks",
    title: "Шторные автомобили",
    cartImg: cartImg1,
    filters: [
      { 
        type: "search",
        label: "Марка", 
        options: ["ГАЗ", "КАМАЗ", "JAC", "DAEWOO", "FOTON", "DONG FENG", "МАЗ"]
      },
      { 
        type: "checkbox", 
        label: "Полная масса, тонн",
        options: ["до 12", "до 20", "до 5,5", "свыше 20"] 
      },
    ],
    content: {
      intro: "Шторный грузовик сочетает удобство загрузки и надежность на дороге. Мощные двигатели и современная техника делают управление безопасным и комфортным. Компания «РусТрак» предлагает шторные автомобили, готовые к любым задачам. Надёжная конструкция и качественные материалы обеспечивают долгий срок службы машин. Выбор подходящей машины поможет справиться с самыми разными задачами. Каждая модель создаётся с учётом потребностей владельцев, сочетая практичность и долговечность.",
      assortment: "Ассортимент",
      assortmentdesc1: "Мы предлагаем широкий ассортимент коммерческих автомобилей, отвечающих современным стандартам качества. В нашем каталоге представлена шторная машина в различных исполнениях и марках, что позволяет подобрать технику под любые задачи эксплуатации.",
      assortmentdesc2: "Размеры и тоннаж автомобилей зависят от выбранного шасси: от компактных моделей грузоподъёмностью 3 тонны до мощных машин, рассчитанных на перевозку до 30 тонн. Такой диапазон позволяет подобрать оптимальное решение для любых логистических и коммерческих задач, обеспечивая надёжность и долговечность техники.",
      brand: "Марки:",
      brands: ["ГАЗ", "Валдай", "КАМАЗ", "Компас", "JAC", "МАЗ", "FAW", "FOTON", "DAEWOO"],
      featuresLabel: "Особенности шторных автомобилей",
      features: [
        {
          featuresdesc: "Оцинкованные стойки на болтовых соединениях — при повреждении их можно быстро заменить без сложного ремонта, что снижает затраты и сокращает простои."
        },
        {
          featuresdesc: "Алюминиевые направляющие с резиновым уплотнителем — шторно бортовой автомобиль получает надёжную герметизацию, защищающую груз от влаги и пыли при эксплуатации в любых условиях.",
        },
        {
          featuresdesc: "Профиль Hossen — усиленный конструктивный элемент, который повышает жёсткость и долговечность всей надстройки.",
        },
        {
          featuresdesc: "Откидные борта на 180° — позволяют легко загружать и разгружать груз с любой стороны, экономя время на маршруте.",
        },
        {
          featuresdesc: "Сдвижная штора в обе стороны — гибкость эксплуатации: доступ к грузу возможен с любой стороны платформы.",
        },
        {
          featuresdesc: "Тент крыши с крестообразным усилителем — выдерживает дополнительные нагрузки и сохраняет форму даже при длительной эксплуатации.",
        },
        {
          featuresdesc: "Двунаправленное усиление бокового тента — повышает надёжность при перевозке тяжёлых и хрупких грузов.",
        },
        {
          featuresdesc: "Скрытые петли крепления груза — безопасная фиксация без выступающих элементов, что делает платформу аккуратной и удобной.",
        },
        {
          featuresdesc: "Складная лестница — быстрый и безопасный доступ к кузову без дополнительных приспособлений.",
        },
        {
          featuresdesc: "Три варианта крепления надстройки к подрамнику — шторный фургон адаптируется к разным условиям монтажа, обеспечивая универсальность для различных задач и типов шасси.", 
        },
        {
          featuresdesc: "Сдвижные центральные стойки — позволяют оптимально использовать пространство и упрощают работу с крупногабаритными грузами.",
        },
        {
          featuresdesc: "Алюминиевые ворота со скрытой запорной арматурой — надёжная защита груза и эстетичный внешний вид без лишних деталей.",
        },
        {
          featuresdesc: "Противозаливной козырёк — дополнительная защита от осадков и грязи, повышающая сохранность перевозимого груза."
        }
        
      ],
      applicationLabel: "Сферы применения",
      applicationDesc: "Шторный грузовик от компании «РусТрак» находят широкое применение в строительных компаниях, логистических и транспортных организациях, обеспечивая безопасную и удобную доставку материалов. Они используются для коммерческой доставки товаров, в торговых и оптовых компаниях, а также при перевозке негабаритных и тяжёлых грузов. Надёжная конструкция и качественная защита груза делают их удобными для длительных маршрутов и работы в любых погодных условиях, обеспечивая эффективность перевозок и сохранность имущества.",
      workingTitle: "Преимущества работы с компанией «РусТрак»",
      workingfeatures: [
        {
          workingFeaturesLabel: "Большой выбор техники",
          workingFeaturesDesc: "У нас представлены шторные и другие коммерческие автомобили различных марок и типов, что позволяет подобрать технику под любые задачи.",
        },
        {
          workingFeaturesLabel: "Профессиональная поддержка",
          workingFeaturesDesc: "Наши специалисты помогают подобрать технику с учётом задач клиента и особенностей бизнеса.",
        },
        {
          workingFeaturesLabel: "Сертификация и контроль качества",
          workingFeaturesDesc: "Все грузовики проходят строгую проверку и сертифицированы, что гарантирует безопасность эксплуатации.",
        },
        {
          workingFeaturesLabel: "Гарантийное и послегарантийное обслуживание",
          workingFeaturesDesc: "Компания обеспечивает поддержку после покупки, включая техническое обслуживание и консультации.",
        },
        {
          workingFeaturesLabel: "Удобство покупки",
          workingFeaturesDesc: "Предоставляются прозрачные условия приобретения, различные формы оплаты и индивидуальные предложения для клиентов.",
        },
        {
          workingFeaturesLabel: "Опыт и репутация",
          workingFeaturesDesc: "«РусТрак» имеет многолетний опыт работы на рынке коммерческих автомобилей, что подтверждает высокий профессионализм и доверие клиентов.",
        }
      ],
      equipmentTItle: "Техника, созданная для надежности и комфорта",
      equipmentdesc: "Купить шторный грузовик — выгодное решение, позволяющее оптимизировать логистику и сократить затраты на эксплуатацию. Выбирая технику, которая соответствует вашим требованиям и стандартам качества, вы получаете надёжный автомобиль, полностью готовый к эксплуатации. Компания «РусТрак» поможет подобрать модель, идеально подходящую для ваших нужд. Ознакомьтесь с характеристиками и возможностями каждой машины. Сделайте выбор в пользу надёжности, комфорта и долговечности вашей техники. Для оформления заказа свяжитесь с нами любым удобным способом и получите консультацию специалистов.",
    },
    trak: [
      {
        id: 1,
        title: "Шторный грузовик МАЗ 438121 (модель 5389D5)",
        img: trak1,
        price: "Цена по запросу",
        mass: "до 12",
        descKey: [
            "Базовое шасси",
            "Двигатель",
            "КПП",
            "Длина автомобиля, мм",
            "Ширина автомобиля, мм",
            "Высота автомобиля, мм",
            "Колесная база, мм",
            "Длина платформы, м",
            "Полная масса, кг",
            "Снаряженная масса, кг",
            "Грузоподъёмность, кг",
            "Объем фургона, м3"
        ],
        descValue: [
            "МАЗ 438121 КОРНЕТ",
            "WP4.1NQ190E50, 190 л.с.",
            "Мех., 6-ти ступ. FAST GEAR 6J76T",
            "9510",
            "2550",
            "3880",
            "5200",
            "7500",
            "11990",
            "5450",
            "6340",
            "48"
        ],
        descImg: descTr1,
        paramLabel: "Шторный грузовик МАЗ 438121-2540-025",
        parametrs: [
            "МАЗ 438121-2540-025",
            "WP4.1NQ190E50, 190 л.с.",
            "Механическая, 6-ти ступенчатая FAST GEAR 6J76T",
            "5200",
            "7500х2550х2850",
            "Сварная рамная конструкция из открытых профилей. Состоит из продольных лонжеронов и поперечных балок, окантовочного и передней стенки профиля HOSSEN. Оцинкованные петли крепления груза в окантовочном профиле платформы (не уменьшают погрузочную ширину платформы), 7 шт. с каждой стороны.",
            "Влагостойкая фанера с противоскользящим покрытием.",
            "Алюминиевые или стальные оцинкованные борта, откидывающиеся, количество секций – 2 шт. на сторону, высота 400 мм.",
            "Выполнена из алюминиевого профиля на всю высоту надстройки",
            "Стальной, высотой 2850 мм. Механизм раздельного сдвижения тента с алюминиевыми направляющими на роликах: крыша, боковые стороны Крюк-багор для сдвижения крыши с кронштейном крепления на правой задней стойке каркаса Обрешетка из доски в три ряда.",
            "Распашные ворота каркасного типа, наружное покрытие армированный пластик, внутреннее влагостойкая фанера толщиной 6 мм. С возможностью фиксации в открытом положении.",
            "Тент из ткани, удельный вес 650 г/м2 Усиление тента крыши на углах Натяжители тента в горизонтальном направлении (трещотка) сзади с обеих сторон Натяжители тента в вертикальном направлении (натяжной замок с стропом и крюком) шаг 0,6м Съёмная передняя штанга боковой шторы для облегченного сдвижения шторы назад.",
            "Пластиковые крылья, брызговики. Боковые влагозащитные габаритные огни."
        ]
    },
    {
        id: 2,
        title: "Шторный грузовик МАЗ 631228-524-010 (модель 4389М2)",
        img: trak2,
        price: "Цена по запросу",
        mass: "до 20",
        descKey: [
            "Базовое шасси",
            "Двигатель",
            "КПП",
            "Длина автомобиля, мм",
            "Ширина автомобиля, мм",
            "Высота автомобиля, мм",
            "Колесная база, мм",
            "Длина платформы, м",
            "Полная масса, кг",
            "Снаряженная масса, кг",
            "Грузоподъёмность, кг",
            "Объем фургона, м3",
            "Объем кузова, м3"
        ],
        descValue: [
            "МАЗ 631228-524-010",
            "WP 12.430E50, 430 л.с.",
            "Мех., 16-ти ступ. ZF 16S2520T",
            "10070",
            "2550",
            "3930",
            "4600+1400",
            "7500",
            "26500",
            "12700",
            "13800",
            "48",
            "45,9"
        ],
        descImg: descTr2,
        paramLabel: "Шторный грузовик МАЗ 631228-524-010",
        parametrs: [
            "МАЗ 631228-524-010",
            "WP 12.430E50, 430 л.с.",
            "Механическая, 16-ти ступенчатая ZF 16S2520T",
            "4600+1400",
            "7500х2550х2600",
            "Сварная рамная конструкция из открытых профилей. Состоит из продольных лонжеронов и поперечных балок, окантовочного и передней стенки профиля HOSSEN. Оцинкованные петли крепления груза в окантовочном профиле платформы (не уменьшают погрузочную ширину платформы), 7 шт. с каждой стороны.",
            "Влагостойкая фанера с противоскользящим покрытием.",
            "Алюминиевые или стальные оцинкованные борта, откидывающиеся, количество секций – 2 шт. на сторону, высота 600 мм. Угол открывания бортов – 1800. Быстросъёмные стойки 1 шт. на сторону с алюминиевыми замками.",
            "Выполнена из алюминиевого профиля на всю высоту надстройки",
            "Стальной, высотой 2200 мм. Механизм раздельного сдвижения тента с алюминиевыми направляющими на роликах: крыша, боковые стороны Крюк-багор для сдвижения крыши с кронштейном крепления на правой задней стойке каркаса Обрешетка из доски в три ряда. Съемная поперечина крыши над воротами, позволяет осуществлять загрузку без ограничений по высоте Водоотводящий алюминиевый козырек над задними воротами Задние и передние стойки оцинкованные",
            "Распашные ворота каркасного типа из наборного алюминиевого профиля со фурнитурой скрытого типа из нержавеющей стали, по 2 штанги на дверь, 4 петли на дверь. С возможностью фиксации в открытом положении.",
            "Тент из ткани, удельный вес 650 г/м2 Усиление тента крыши на углах Натяжители тента в горизонтальном направлении (трещотка) сзади с обеих сторон Натяжители тента в вертикальном направлении (натяжной замок с стропом и крюком) шаг 0,6м Съёмная передняя штанга боковой шторы для облегченного сдвижения шторы назад.",
            "Пластиковые крылья, брызговики. Боковые влагозащитные габаритные огни. Боковая защита от базового шасси Заднее защитное устройство Оцинкованная выдвижная лестница. Поручень для подъёма на платформу."
        ]
    },
    {
        id: 3,
        title: "Шторный грузовик КАМАЗ 4308",
        img: trak3,
        price: "Цена по запросу",
        mass: "свыше 20",
        descKey: [
            "Базовое шасси",
            "Двигатель",
            "КПП",
            "Длина автомобиля, мм",
            "Ширина автомобиля, мм",
            "Высота автомобиля, мм",
            "Колесная база, мм",
            "Длина платформы, м",
            "Полная масса, кг",
            "Снаряженная масса, кг",
            "Грузоподъёмность, кг",
            "Объем фургона, м3"
        ],
        descValue: [
            "КАМАЗ 4308-3083-69(G5)",
            "Cummins ISB6.7 E5 250, 250 л. с.",
            "Мех., 9-ступенчатая ZF9",
            "10900",
            "2550",
            "3990",
            "4780",
            "8500",
            "11980",
            "6020",
            "4780",
            "38...59"
        ],
        paramLabel: "Шторный грузовик КАМАЗ 4308-3083-69(G5)",
        parametrs: [
            "КАМАЗ 4308-3083-69(G5)",
            "Cummins ISB6.7 E5 250, 250 л. с.",
            "Механическая, 9-ступенчатая ZF9",
            "4780",
            "8500х2550х2850",
            "Сварная рамная конструкция из открытых профилей. Состоит из продольных лонжеронов и поперечных балок, окантовочного и передней стенки профиля HOSSEN. Оцинкованные петли крепления груза в окантовочном профиле платформы (не уменьшают погрузочную ширину платформы), 7 шт. с каждой стороны.",
            "Влагостойкая фанера с противоскользящим покрытием.",
            "Алюминиевые или стальные оцинкованные борта, откидывающиеся, количество секций – 2 шт. на сторону, высота 400 мм. Угол открывания бортов – 1800 Сдвижные стойки 2 шт. на сторону с алюминиевыми замками.",
            "Выполнена из алюминиевого профиля на всю высоту надстройки",
            "Стальной, высотой 2850 мм. Механизм раздельного сдвижения тента с алюминиевыми направляющими на роликах: крыша, боковые стороны Крюк-багор для сдвижения крыши с кронштейном крепления на правой задней стойке каркаса Обрешетка из доски в четыре ряда. Съемная поперечина крыши над воротами, позволяет осуществлять загрузку без ограничений по высоте Водоотводящий алюминиевый козырек над задними воротами Задние и передние стойки оцинкованные",
            "Распашные ворота каркасного типа, наружное покрытие армированный пластик, внутреннее влагостойкая фанера толщиной 6 мм. С возможностью фиксации в открытом положении. Фурнитура из оцинкованной стали, по 2 штанги на дверь по 4 петли на дверь. С возможностью фиксации в открытом положении.",
            "Тент из ткани, удельный вес 650 г/м2 Усиление тента крыши на углах Натяжители тента в горизонтальном направлении (трещотка) сзади с обеих сторон Натяжители тента в вертикальном направлении (натяжной замок с стропом и крюком) шаг 0,5 м Съёмная передняя штанга боковой шторы для облегченного сдвижения шторы назад.",
            "Пластиковые крылья, брызговики из энергопоглощающего материала. Боковые влагозащитные габаритные огни. Задний противоподкатный брус-от базового шасси. Устройства световой сигнализации и светоотражающая лента в соответствии с требованиями по эксплуатации автомобиля. Оцинкованная выдвижная лестница. Поручень для подъёма на платформу."
        ]
    },
    {
        id: 4,
        title: "Шторный грузовик КАМАЗ 65657",
        img: trak4,
        price: "Цена по запросу",
        mass: "до 20",
        descKey: [
            "Базовое шасси",
            "Двигатель",
            "КПП",
            "Длина автомобиля, мм",
            "Ширина автомобиля, мм",
            "Высота автомобиля, мм",
            "Колесная база, мм",
            "Длина платформы, м",
            "Полная масса, кг",
            "Снаряженная масса, кг",
            "Грузоподъёмность, кг",
            "Объем фургона, м3"
        ],
        descValue: [
            "КАМАЗ 65657",
            "КАМАЗ 910.12-450, 450 л. с.",
            "Автомат., 12-ступенчатая",
            "11985",
            "2440",
            "3940",
            "5150+1350",
            "8300",
            "27000",
            "12200",
            "14800",
            "33...52"
        ],
        paramLabel: "Шторный грузовик КАМАЗ 65657",
        parametrs: [
            "КАМАЗ 65657",
            "КАМАЗ 910.12-450, 450 л. с.",
            "Автоматическая, 12-ступенчатая Fast Gear F12|Z22DD+QHG50B-GM02184",
            "5150+1350",
            "8300x2550x2800",
            "Сварная рамная конструкция из открытых профилей. Состоит из продольных лонжеронов и поперечных балок, окантовочного и передней стенки профиля HOSSEN. Оцинкованные петли крепления груза в окантовочном профиле платформы (не уменьшают погрузочную ширину платформы), 8 шт. с каждой стороны.",
            "Влагостойкая фанера с противоскользящим покрытием толщиной 27 мм.",
            "Алюминиевые борта, откидывающиеся, количество секций – 3 шт. на сторону, высота 600 мм. Угол открывания бортов – 1800 Сдвижные стойки 2 шт. на сторону с алюминиевыми замками.",
            "Выполнена из алюминиевого профиля на всю высоту надстройки",
            "Стальной, высотой 2800 мм. Механизм раздельного сдвижения тента с алюминиевыми направляющими на роликах: крыша, боковые стороны Крюк-багор для сдвижения крыши с кронштейном крепления на правой задней стойке каркаса Обрешетка из доски в три ряда. Съемная поперечина крыши над воротами, позволяет осуществлять загрузку без ограничений по высоте Водоотводящий алюминиевый козырек над задними воротами Задние и передние стойки оцинкованные",
            "Распашные ворота каркасного типа, наружное покрытие армированный пластик, внутреннее влагостойкая фанера толщиной 6 мм. С возможностью фиксации в открытом положении. Фурнитура из нержавеющей стали с замками типа PUSH, по 2 штанги на дверь по 4 петли на дверь. С возможностью фиксации в открытом положении.",
            "Тент из ткани, удельный вес 650 г/м2 Усиление тента крыши на углах Натяжители тента в горизонтальном направлении (трещотка) сзади с обеих сторон Натяжители тента в вертикальном направлении (натяжной замок с стропом и крюком) шаг 0,5 м Съёмная передняя штанга боковой шторы для облегченного сдвижения шторы назад.",
            "Пластиковые крылья, брызговики. Боковые влагозащитные габаритные огни. Боковая защита от базового шасси Заднее защитное устройство Оцинкованная выдвижная лестница. Поручень для подъёма на платформу."
        ]
    },
    {
        id: 5,
        title: "Шторный грузовик КОМПАС 5",
        img: trak5,
        price: "Цена по запросу",
        mass: "до 5.5",
        descKey: [
            "Базовое шасси",
            "Двигатель",
            "КПП",
            "Длина автомобиля, мм",
            "Ширина автомобиля, мм",
            "Высота автомобиля, мм",
            "Колесная база, мм",
            "Длина платформы, м",
            "Полная масса, кг",
            "Снаряженная масса, кг",
            "Грузоподъёмность, кг",
            "Объем фургона, м3"
        ],
        descValue: [
            "КОМПАС 5",
            "КАМАЗ 580.10-120, 122 л.с.",
            "Мех., 5-ти ступенчатая",
            "6410",
            "2300",
            "3110",
            "3365",
            "4600",
            "3490",
            "2270",
            "1220",
            "18,5...22"
        ],
        paramLabel: "Шторный грузовик КОМПАС 5",
        parametrs: [
            "КОМПАС 5",
            "КАМАЗ 580.10-120, 122 л.с.",
            "Механическая, 5-ти ступенчатая",
            "3365",
            "4600x2300x2200",
            "Сварная рамная конструкция из открытых профилей. Состоит из продольных лонжеронов и поперечных балок, окантовочного и передней стенки профиля HOSSEN. Оцинкованные петли крепления груза в окантовочном профиле платформы (не уменьшают погрузочную ширину платформы), 3 шт. с каждой стороны.",
            "Влагостойкая фанера с противоскользящим покрытием.",
            "Алюминиевые или стальные оцинкованные борта, откидывающиеся, количество секций – 2 шт. на сторону, высота 400 мм. Угол открывания бортов – 1800 Быстросъёмные стойки 1 шт. на сторону с алюминиевыми замками.",
            "Выполнена из алюминиевого профиля на всю высоту надстройки",
            "Стальной, высотой 2200 мм. Механизм раздельного сдвижения тента с алюминиевыми направляющими на роликах: крыша, боковые стороны Крюк-багор для сдвижения крыши с кронштейном крепления на правой задней стойке каркаса Обрешетка из доски в три ряда. Съемная поперечина крыши над воротами, позволяет осуществлять загрузку без ограничений по высоте Водоотводящий алюминиевый козырек над задними воротами",
            "Распашные ворота каркасного типа, наружное покрытие армированный пластик, внутреннее влагостойкая фанера толщиной 6 мм. С возможностью фиксации в открытом положении. Фурнитура из оцинкованной стали, по 1 штанге на дверь по 3 петли на дверь.",
            "Тент из ткани, удельный вес 650 г/м2 Усиление тента крыши на углах Натяжители тента в горизонтальном направлении (трещотка) сзади с обеих сторон Натяжители тента в вертикальном направлении (натяжной замок с стропом и крюком) шаг 0,6м Съёмная передняя штанга боковой шторы для облегченного сдвижения шторы назад.",
            "Пластиковые крылья, брызговики. Боковые влагозащитные габаритные огни. Боковая защита от базового шасси Заднее защитное устройство Оцинкованная выдвижная лестница. Поручень для подъёма на платформу."
        ]
    },
    {
        id: 6,
        title: "Шторный грузовик КАМАЗ 65117 (модель 4388F3)",
        img: trak6,
        price: "Цена по запросу",
        mass: "свыше 20",
        descKey: [
            "Базовое шасси",
            "Двигатель",
            "КПП",
            "Длина автомобиля, мм",
            "Ширина автомобиля, мм",
            "Высота автомобиля, мм",
            "Колесная база, мм",
            "Длина платформы, м",
            "Полная масса, кг",
            "Снаряженная масса, кг",
            "Грузоподъёмность, кг",
            "Объем фургона, м3"
        ],
        descValue: [
            "КАМАЗ 65117",
            "Cummins ISB6.7 E5 300, 215 л.с.",
            "Мех., 9-ступенчатая",
            "10320",
            "2550",
            "3750",
            "4970+1320",
            "7800",
            "11400",
            "7925",
            "12600",
            "48.1"
        ],
        paramLabel: "Шторный грузовик КАМАЗ 65117 (модель 4389Z2)",
        parametrs: [
            "65117-3010-48(A5)",
            "Cummins ISB6.7 E5 300 (Euro 5)",
            "Механическая, 9-ступенчатая",
            "4970+1320",
            "7800x2550x2800",
            "Сварная рамная конструкция из открытых профилей. Состоит из продольных лонжеронов и поперечных балок, окантовочного и передней стенки профиля HOSSEN. Оцинкованные петли крепления груза в окантовочном профиле платформы (не уменьшают погрузочную ширину платформы), 7 шт. с каждой стороны.",
            "Влагостойкая фанера с противоскользящим покрытием.",
            "Алюминиевые или стальные оцинкованные борта, откидывающиеся, количество секций – 2 шт. на сторону, высота 600 мм. Угол открывания бортов – 1800. Быстросъёмные стойки 1 шт. на сторону с алюминиевыми замками.",
            "Выполнена из алюминиевого профиля на всю высоту надстройки",
            "Стальной, высотой 2800 мм. Механизм раздельного сдвижения тента с алюминиевыми направляющими на роликах: крыша, боковые стороны Крюк-багор для сдвижения крыши с кронштейном крепления на правой задней стойке каркаса Обрешетка из доски в три ряда. Съемная поперечина крыши над воротами, позволяет осуществлять загрузку без ограничений по высоте Водоотводящий алюминиевый козырек над задними воротами Задние и передние стойки оцинкованные",
            "Распашные ворота каркасного типа, наружное покрытие армированный пластик, внутреннее влагостойкая фанера толщиной 6 мм. С возможностью фиксации в открытом положении. Фурнитура из оцинкованной стали, по 2 штанги на дверь по 4 петли на дверь. С возможностью фиксации в открытом положении.",
            "Тент из ткани, удельный вес 650 г/м2 Усиление тента крыши на углах Натяжители тента в горизонтальном направлении (трещотка) сзади с обеих сторон Натяжители тента в вертикальном направлении (натяжной замок с стропом и крюком) шаг 0,6м Съёмная передняя штанга боковой шторы для облегченного сдвижения шторы назад.",
            "Пластиковые крылья, брызговики. Боковые влагозащитные габаритные огни. Боковая защита от базового шасси Заднее защитное устройство Оцинкованная выдвижная лестница. Поручень для подъёма на платформу."
        ]
    },
    ]
  },
  "Crane-manipulators": {
    slug: "Crane-manipulators",
    title: "Краны-манипуляторы",
    cartImg: cartImg2,
    filters: [
      { 
        type: "search", 
        label: "Марка", 
        options: ["ГАЗ", "КАМАЗ", "JAC", "DAEWOO", "FAW", "FOTON", "DONG FENG", "SHACMAN", "BAW", "INMAN", "URAL", "МАЗ"] 
      },
      {
        type: "checkbox",
        label: "Колесная формула",
        options: ["4x2", "6x4", "4x4"]
      },
      { 
        type: "checkbox", 
        label: "Полная масса, тонн", 
        options: ["до 12", "до 20", "свыше 20"] 
      },
      {
        type: "checkbox",
        label: "Длина платформы, м",
        options: ["3500", "4400", "5200", "5500", "6165", "6200", "6400", "6500", "6700", "6800", "7000", "7200", "8200"]
      },
      {
        type: "range",
        label: "Грузоподъёмность КМУ, тонн",
      }
    ],
    content: {
      intro: "Грузоподъёмная техника обеспечивает удобство при работе с тяжёлыми материалами. Автомобиль с краном манипулятором помогает выполнять погрузку и перевозку без лишних усилий. Такая техника отличается маневренностью и точной работой. Компания «РусТрак» предлагает модели, рассчитанные на разные условия. Качество сборки, надёжность механизмов и продуманная конструкция позволяют технике долго служить без сбоев. Такой транспорт дарит ощущение надёжности и уверенно помогает справляться со сложными задачами.",
      assortment: "Ассортимент",
      assortmentdesc1: "Компания «РусТрак» предлагает широкий выбор моделей для разных типов работ и условий эксплуатации, подбирая технику с оптимальной мощностью и характеристиками, чтобы она эффективно справлялась с поставленными задачами. Мы осуществляем монтаж кранов‑манипуляторов ведущих производителей:",
      assortmentdesc2: "В зависимости от задач можно выбрать подходящий тип КМУ:",
      assortmentdesc2features: [
        "Тросовый — стрела оснащена тросом, что делает возможной и удобной работу ниже уровня земли. В транспортном положении она не складывается за кабиной, что особенно полезно при выполнении специфических задач.",
        "Шарнирно‑сочленённый (крюковой) — вместо троса используется крюк. Конструкция складывается за кабиной в транспортном положении, благодаря чему техника становится компактной и удобной при перемещении.",
      ],
      brands: ["ИНМАН", "HKTC", "XCMG", "ПАЛФИНГЕР", "HANGIL", "DY", "UNIC", "FASSI", "SOOSAN"],
      featuresLabel: "Конструктивные особенности крана-манипулятора",
      features: [
        {
          featuresdesc: "Прочный профиль Hossen — надёжная основа, благодаря которой грузовая машина с краном манипулятором сохраняет устойчивость и долговечность."
        },
        {
          featuresdesc: "Основание из открытых профилей — оптимальное решение для высокой прочности и стабильности при эксплуатации."
        },
        {
          featuresdesc: "Усиленная монтажная плита задних опор — гарантирует надёжность при работе с тяжёлыми грузами.",
        },
        {
          featuresdesc: "Откидные борта на 180° — удобная загрузка и разгрузка с любой стороны, благодаря чему бортовая машина с КМУ работает быстрее и эффективнее.",
        },
        {
          featuresdesc: "Надёжное крепление КМУ — установка через широкую монтажную плиту и фиксация на шпильках обеспечивает безопасность и долгий срок службы."
        },
        {
          featuresdesc: "Износостойкий настил пола из транспортной фанеры — все швы тщательно герметизированы, что защищает от влаги и продлевает срок эксплуатации."
        },
        {
          featuresdesc: "Защита кабины — предотвращает случайные повреждения, сохраняя целостность при эксплуатации и делая грузовой автомобиль с КМУ более безопасным."
        },
        {
          featuresdesc: "Сдвижная крыша — удобный доступ и дополнительная защита перевозимых материалов."
        },
        {
          featuresdesc: "Окрас платформы в цвет крана — единый стиль и аккуратный внешний вид техники."
        },
        {
          featuresdesc: "Противосдвиговые пластины на раме — надёжное соединение надстройки с рамой, усиление конструкции с обеих сторон."
        },
        {
          featuresdesc: "Скрытые петли крепления груза — безопасная фиксация и эстетичный внешний вид без лишних деталей."
        },
      ],
      applicationLabel: "Сферы применения",
      applicationDesc: "Кран манипулятор цена которого остаётся доступной при высоком качестве техники, находит широкое применение в самых разных сферах. Он эффективно используется на строительных площадках для подъёма и транспортировки стройматериалов, в коммунальном хозяйстве при обслуживании инфраструктуры и перевозке оборудования, а также в логистике и складских операциях для разгрузки и погрузки контейнеров и крупногабаритных грузов. Благодаря универсальности и маневренности техника подходит для работы в условиях ограниченного пространства, на городских улицах и промышленных территориях, обеспечивая высокую производительность и сокращение времени на выполнение задач.",
      workingTitle: "Преимущества работы с компанией «РусТрак»",
      workingfeatures: [
        {
          workingFeaturesDesc: "Широкий выбор техники – большой ассортимент кранов-манипуляторов и грузовых автомобилей различных марок и конфигураций.",
        },
        {
          workingFeaturesDesc: "Качество и надёжность – техника проверена на прочность и долговечность, соответствует высоким стандартам эксплуатации.",
        },
        {
          workingFeaturesDesc: "Профессиональная поддержка – специалисты помогают подобрать оптимальное решение под конкретные задачи и условия работы.",
        },
        {
          workingFeaturesDesc: "Сервис и обслуживание – компания обеспечивает техническую поддержку и консультации на всех этапах эксплуатации.",
        },
        {
          workingFeaturesDesc: "Оперативная доставка – любая машина с краном манипулятором быстро поставляется в регионы.",
        },
        {
          workingFeaturesDesc: "Индивидуальный подход – учитываются потребности каждого клиента, предлагаются оптимальные комплектации и дополнительные опции.",
        }
      ],
      equipmentTItle: "Надёжная техника для любых задач",
      equipmentdesc: "Купить кран манипулятор – выгодное решение для тех, кто ценит практичность и экономию времени. Мы поможем подобрать технику под ваши задачи и условия работы. Компания «РусТрак» обеспечивает большой выбор и качественное обслуживание. Сделайте уверенный шаг к повышению эффективности своих процессов. Получите профессиональную консультацию и оперативное сопровождение. Для оформления заказа свяжитесь с нами любым удобным способом.",
    },
    trak: [
      {
        id: 1,
        title: "КРАН-МАНИПУЛЯТОР МАЗ 6312C5-8535-012 С КМУ ИНМАН ИТ 150 (МОДЕЛЬ 4389N8)",
        img: trak7,
        price: "Цена по запросу",
        mass: "до 20",
        formula: "4x2",
        descKey: [
            "Базовое шасси",
            "Двигатель",
            "КПП",
            "Длина автомобиля, мм",
            "Ширина автомобиля, мм",
            "Высота автомобиля, мм",
            "Колесная база, мм",
            "Длина платформы, м",
            "Полная масса, кг",
            "Снаряженная масса, кг",
            "Грузоподъёмность, кг",
            "Грузоподъёмность КМУ, тонн",
            "Вылет стрелы, м"
        ],
        descValue: [
            "МАЗ 6312C5-8535-012",
            "ЯМЗ-53603, 300 л. с.",
            "Механическая 9-ти ступенчатая",
            "10650",
            "2550",
            "3705",
            "4600+1400",
            "6700",
            "33500",
            "17880",
            "17360",
            "7,05",
            "8,05"
        ],
        descImg: descTr3,
        paramLabel: "Кран-манипулятор МАЗ 6312C5-8535-012 с КМУ ИНМАН ИТ 150",
        parametrs: [
            "МАЗ 6312C5-8535-012",
            "ЯМЗ-53603, 300 л. с.",
            "Механическая 9-ти ступенчатая",
            "4600+1400",
            "6700x2550x600",
            "Сварная рамная конструкция из открытых профилей. Состоит из продольных лонжеронов и поперечных балок, окантовочного и передней стенки профиля HOSSEN. Оцинкованные петли крепления груза в окантовочном профиле платформы (не уменьшают погрузочную ширину платформы), 5 шт. с каждой стороны.",
            "Влагостойкая фанера толщиной 24 мм с противоскользящим покрытием.",
            "Стальные оцинкованные или алюминиевые борта, откидывающиеся, количество секций – 2 шт. на сторону, высота 600 мм. Угол открывания бортов – 1800. Быстросъёмные стойки ломающегося типа по 2 на сторону с алюминиевыми замками.",
            "Пластиковые крылья, брызговики. Боковые влагозащитные габаритные огни. Боковая защита из алюминиевых профилей на откидных оцинкованных кронштейнах. Заднее защитное устройство. Ступень для подъёма на платформу.",
            "Пластиковые крылья, брызговики. Боковые влагозащитные габаритные огни. Боковая защита из алюминиевых профилей на откидных оцинкованных кронштейнах. Заднее защитное устройство. Ступень для подъёма на платформу.",
            "Пластиковые крылья, брызговики. Боковые влагозащитные габаритные огни. Боковая защита из алюминиевых профилей на откидных оцинкованных кронштейнах. Заднее защитное устройство. Ступень для подъёма на платформу.",
            "Пластиковые крылья, брызговики. Боковые влагозащитные габаритные огни. Боковая защита из алюминиевых профилей на откидных оцинкованных кронштейнах. Заднее защитное устройство. Ступень для подъёма на платформу.",
            "Пластиковые крылья, брызговики. Боковые влагозащитные габаритные огни. Боковая защита из алюминиевых профилей на откидных оцинкованных кронштейнах. Заднее защитное устройство. Ступень для подъёма на платформу.",
        ]
      },
      {
          id: 2,
          title: "КРАН-МАНИПУЛЯТОР МАЗ 631228 С КМУ PALFINGER SPK 23500",
          img: trak8,
          price: "Цена по запросу",
          mass: "до 20",
          formula: "4x2",
          descKey: [
              "Базовое шасси",
              "Тип надстройки",
              "Двигатель",
              "КПП",
              "Колесная база, мм",
              "Габаритные размеры автомобиля, ДхШхВ (мм)",
              "Полная масса (кг)",
              "Снаряженная масса (кг)",
              "Габаритные размеры бортовой платформы, ДхШхВ (мм)"
          ],
          descValue: [
              "МАЗ-631228-8525-012",
              "Бортовая платформа с КМУ",
              "WP 12.430E50, 423 л. с.",
              "Механическая, 16-ступенчатая",
              "4600+1400",
              "10580x2550x3520",
              "33500",
              "16000",
              "6200x2550x600"
          ],
          paramLabel: "Кран-манипулятор МАЗ 631228 с PALFINGER SPK 23500",
          parametrs: [
              "МАЗ-631228-8525-012",
              "Бортовая платформа с КМУ",
              "WP 12.430E50, 423 л. с.",
              "Механическая, 16-ступенчатая",
              "4600+1400",
              "10580x2550x3520",
              "33500",
              "16000",
              "6200x2550x600",
              "Сварная рамная конструкция из открытых профилей. Состоит из продольных лонжеронов и поперечных балок, окантовочного и передней стенки профиля HOSSEN. Оцинкованные петли крепления груза в окантовочном профиле платформы (не уменьшают погрузочную ширину платформы), 5 шт. с каждой стороны.",
              "Влагостойкая фанера с противоскользящим покрытием.",
              "Стальные оцинкованные или алюминиевые борта, откидывающиеся, количество секций – 2 шт. на сторону, высота 400 или 600 мм. Угол открывания бортов – 1800. Быстросъёмные стойки ломающегося типа по 1 на сторону с алюминиевыми замками.",
              "Пластиковые крылья, брызговики. Боковые влагозащитные габаритные огни. Боковая защита из алюминиевых профилей на откидных оцинкованных кронштейнах. Заднее защитное устройство. Ступень для подъёма на платформу."
          ]
      },
      {
          id: 3,
          title: "КРАН-МАНИПУЛЯТОР МАЗ 631228 С КМУ ИНМАН ИТ 150",
          img: trak9,
          price: "Цена по запросу",
          mass: "до 12",
          formula: "4x2",
          descKey: [
              "Базовое шасси",
              "Двигатель",
              "КПП",
              "Длина автомобиля, мм",
              "Ширина автомобиля, мм",
              "Высота автомобиля, мм",
              "Колесная база, мм",
              "Длина платформы, м",
              "Полная масса, кг",
              "Снаряженная масса, кг",
              "Грузоподъёмность, кг",
              "Грузоподъёмность КМУ, тонн",
              "Вылет стрелы, м"
          ],
          descValue: [
              "МАЗ 631228",
              "WP 12.430E50, 423 л. с.",
              "Механическая, 12-ти или 16-ти ступ.",
              "10540",
              "2550",
              "3700",
              "4400+1400 мм или 4600+1400",
              "6700",
              "33500",
              "16140",
              "17360",
              "7,05",
              "19"
          ],
          paramLabel: "Кран-манипулятор МАЗ 631228 с КМУ ИНМАН ИТ 150",
          parametrs: [
              "МАЗ 631228",
              "Бортовая платформа с КМУ",
              "WP 12.430E50, 423 л. с.",
              "Механическая, 12-ти или 16-ти ступенчатая",
              "4400+1400 мм или 4600+1400",
              "10540x2550x3700",
              "33500",
              "16140",
              "6700x2550x600",
              "Сварная рамная конструкция из открытых профилей. Состоит из продольных лонжеронов и поперечных балок, окантовочного и передней стенки профиля HOSSEN. Оцинкованные петли крепления груза в окантовочном профиле платформы (не уменьшают погрузочную ширину платформы), 7 шт. с каждой стороны.",
              "Влагостойкая фанера с противоскользящим покрытием.",
              "Стальные оцинкованные или алюминиевые борта, откидывающиеся, количество секций – 3 шт. на сторону, высота 600 мм. Угол открывания бортов – 1800. Быстросъёмные стойки ломающегося типа по 2 на сторону с алюминиевыми замками.",
              "Пластиковые крылья, брызговики. Боковые влагозащитные габаритные огни. Боковая защита из алюминиевых профилей на откидных оцинкованных кронштейнах. Заднее защитное устройство. Ступень для подъёма на платформу."
          ]
      },
      {
          id: 4,
          title: "КРАН-МАНИПУЛЯТОР КАМАЗ 43118 С КМУ ИНМАН ИМ150N (МОДЕЛЬ 4388С2-10)",
          img: trak10,
          price: "Цена по запросу",
          mass: "свыше 20",
          formula: "4x2",
          descKey: [
              "Базовое шасси",
              "Двигатель",
              "КПП",
              "Длина автомобиля, мм",
              "Ширина автомобиля, мм",
              "Высота автомобиля, мм",
              "Колесная база, мм",
              "Длина платформы, м",
              "Полная масса, кг",
              "Снаряженная масса, кг",
              "Грузоподъёмность, кг",
              "Грузоподъёмность КМУ, тонн",
              "Вылет стрелы, м"
          ],
          descValue: [
              "КАМАЗ 43118",
              "КАМАЗ 740.705-300, 300 л. с.",
              "Механическая, 10-ти ступенчатая",
              "10560",
              "2550",
              "3630",
              "4600+1320",
              "7000",
              "22500",
              "12980",
              "9520",
              "6,1",
              "14,3"
          ],
          descImg: descTr4,
          paramLabel: "Кран-манипулятор КАМАЗ 43118 с КМУ ИНМАН ИМ150N",
          parametrs: [
              "КАМАЗ 43118",
              "Бортовая платформа с КМУ",
              "КАМАЗ 740.705-300, 300 л. с.",
              "Механическая, 10-ти ступенчатая",
              "4600+1320",
              "10560x2550x3630",
              "22500",
              "12980",
              "7000x2550x600",
              "Сварная рамная конструкция из открытых профилей. Состоит из продольных лонжеронов и поперечных балок, окантовочного и передней стенки профиля HOSSEN. Оцинкованные петли крепления груза в окантовочном профиле платформы (не уменьшают погрузочную ширину платформы), 5 шт. с каждой стороны.",
              "Влагостойкая фанера с противоскользящим покрытием толщиной.",
              "Стальные оцинкованные или алюминиевые борта, откидывающиеся, количество секций – 2 шт. на сторону, высота 600 мм. Угол открывания бортов – 1800. Быстросъёмные стойки ломающегося типа по 1 шт. на сторону с алюминиевыми замками.",
              "Пластиковые крылья, брызговики. Боковые влагозащитные габаритные огни. Боковая защита из алюминиевых профилей на откидных оцинкованных кронштейнах. Заднее защитное устройство. Ступень для подъёма на платформу."
          ]
      },
    ]
  },
  "Fuel-bowsers": {
    slug: "Fuel-bowsers",
    title: "Автотопливозаправщики",
    cartImg: cartImg6,
    filters: [
      {
        type: "range",
        label: "Цена",
      },
      { 
        type: "search", 
        label: "Марка", 
        options: ["ГАЗ", "JAC", "FAW", "FOTON", "DONGFENG", "SOLLERS", "УРАЛ", "Валдай"] 
      },
      { 
        type: "checkbox", 
        label: "Полная масса, тонн", 
        options: ["до 12"] 
      },
      {
        type: "range",
        label: "Объем цистерны, л.",
      }
    ],
    content: {
      intro: "Надёжное снабжение топливом упрощает работу на любых объектах. Купить автотопливозаправщик — возможность заправлять технику прямо на месте, экономя время и снижая расходы. Оборудование оснащено прочными цистернами и современными насосами для точного учета топлива. Компания «РусТрак» предлагает модели, которые подходят для различных задач и объёмов. Выбор подходящего автозаправщика зависит от интенсивности работы и условий эксплуатации. Использование проверенных систем заправки гарантирует безопасность и бесперебойную работу на всех объектах.",
      assortment: "Ассортимент",
      assortmentdesc1: "Компания «РусТрак» предлагает разнообразную технику, где каждая модель АТЗ адаптирована под различные задачи и объёмы работы. В нашем каталоге представлены автомобили ведущих марок:",
      assortmentdesc2: "Доступные варианты вместимости цистерн:",
      assortmentdesc3: "Все модели сертифицированы и соответствуют современным стандартам качества и безопасности, что гарантирует надёжность, долговечность и уверенность в бесперебойной работе.",
      assortmentdesc2features: [
        "5 200 литров (5 м³)",
        "6 000 литров (6 тонн)",
        "8 000 литров (8 м³)",
        "10 000 литров (10 м³)",
        "12 000 литров (12 м³)",
      ],
      brands: ["ГАЗ", "КАМАЗ", "JAC", "FAW", "FOTON"],
      featuresLabel: "Особенности автотопливозаправщиков",
      features: [
        {
          featuresdesc: "Гибкость эксплуатации – автомобильный топливозаправщик оснащён двумя топливными отсеками, что позволяет работать сразу с разными видами горючего."
        },
        {
          featuresdesc: "Надежность и долговечность – цистерна выполнена из прочной стали 09Г2С толщиной 3 мм."
        },
        {
          featuresdesc: "Минимальные затраты на обслуживание – алюминиевые коммуникации легкие, устойчивые к коррозии и не требуют сложного ухода.",
        },
        {
          featuresdesc: "Дополнительная защита на дороге – боковое устройство из алюминия снижает риск повреждений при движении.",
        },
        {
          featuresdesc: "Быстрый доступ к узлам – складная алюминиевая лестница облегчает обслуживание."
        },
        {
          featuresdesc: "Экономия времени при заправке – топливозаправочные машины оснащены шиберным насосом с производительностью 600 л/мин, что обеспечивает высокую скорость работы."
        },
        {
          featuresdesc: "Удобство подключения – два всасывающих рукава длиной по 3 метра позволяют организовать заправку в любых условиях."
        },
        {
          featuresdesc: "Сокращение простоев – быстроразъемные соединения Elaflex Ду-75 гарантируют надежность и ускоряют процессы."
        },
        {
          featuresdesc: "Комфорт при работе – крышка узла выдачи топлива оснащена газлифтами для удобного и безопасного использования."
        },
        {
          featuresdesc: "Защита горловин – автоцистерна для ГСМ оснащена ограждением по всей длине, что облегчает обслуживание и повышает безопасность."
        },
        {
          featuresdesc: "Работа на расстоянии – раздаточный рукав Ду-25 длиной 10 метров обеспечивает удобство при заправке."
        },
        {
          featuresdesc: "Стабильность давления – дыхательное устройство УД-33 гарантирует безопасное хранение топлива."
        },
        {
          featuresdesc: "Полный контроль электросистемы – мобильный заправщик оборудован тремя выключателями массы, позволяющими обесточить машину с любой стороны и из кабины."
        },
        {
          featuresdesc: "Простота операций – управление донными клапанами сосредоточено в узле выдачи, что делает процесс быстрым и надежным."
        },
        {
          featuresdesc: "Защита от статического электричества – штырь заземления длиной 10 метров обеспечивает безопасность при работе с горючим."
        },
      ],
      applicationLabel: "Сферы применения",
      applicationDesc: "Купить автотопливозаправщик выгодно для любых сфер деятельности, где требуется оперативная заправка автомобилей и спецмашин. Он незаменим на строительных площадках, где оборудование должно работать без простоев, а также в сельском хозяйстве для обслуживания тракторов и комбайнов. В промышленности и на производственных объектах он обеспечивает бесперебойную работу автопарка. Системы заправки активно применяются коммунальными и дорожными службами, а также транспортными компаниями, которым важно экономить время и ресурсы. Кроме того, автозаправщики подходят для организации мобильных заправочных станций на удалённых объектах и мероприятиях. Их универсальность делает процесс снабжения топливом проще, безопаснее и эффективнее.",
      workingTitle: "Преимущества работы с компанией «РусТрак»",
      workingfeatures: [
        {
          workingFeaturesDesc: "Разнообразие техники – возможность подобрать автотопливозаправщик под любые задачи и объемы работы.",
        },
        {
          workingFeaturesDesc: "Качество и надежность – автотопливозаправщик соответствует современным стандартам и обеспечена системами безопасности.",
        },
        {
          workingFeaturesDesc: "Помощь в выборе оборудования – специалисты компании консультируют и подбирают оптимальное решение с учетом ваших потребностей.",
        },
        {
          workingFeaturesDesc: "Мобильная доставка и оперативность – техника доставляется и вводится в эксплуатацию без лишних задержек.",
        },
        {
          workingFeaturesDesc: "Техническая поддержка и сервис – компания обеспечивает обслуживание, ремонт и консультации по эксплуатации оборудования.",
        },
        {
          workingFeaturesDesc: "Экономия времени и ресурсов – с правильным автозаправщиком вы сокращаете простои техники и снижаете расходы на топливо.",
        },
        {
          workingFeaturesDesc: "Индивидуальный подход к каждому клиенту – решение подбирается с учетом особенностей работы, объема и условий эксплуатации.",
        }
      ],
      equipmentTItle: "Простая и безопасная заправка на месте",
      equipmentdesc: "Купить автотопливозаправщик — первый шаг к удобному и безопасному обеспечению транспорта топливом. Не откладывайте решение — выберите модель, которая идеально подходит для ваших задач. Компания «РусТрак» имеет большой выбор надёжных и современных автозаправщиков. Мы поможем определить подходящее решение, учитывая ваши потребности и условия эксплуатации. Убедитесь, что ваш автопарк всегда заправлен и готов к работе. Для оформления заказа свяжитесь с нами любым удобным способом, и мы подберём оптимальный вариант именно для вас.",
    },
    trak: [
      {
        id: 1,
        title: "ТОПЛИВОЗАПРАВЩИК САДКО 9 (С41А13) С АТЗ 4,5 М3 ДВУХСЕКЦИОННАЯ",
        img: trak11,
        price: "от 8 800 000Р",
        mass: "до 12",
        descKey: [
            "Базовое шасси",
            "Двигатель",
            "КПП",
            "Длина автомобиля, мм",
            "Ширина автомобиля, мм",
            "Высота автомобиля, мм",
            "Колесная база, мм",
            "Полная масса, кг",
            "Объем цистерны, л.",
            "Количество отсеков, шт."
        ],
        descValue: [
            "ГАЗ C41R13",
            "ЯМЗ-53443, 168,9 л.с.",
            "Механическая, 5-ступенчатая",
            "6530",
            "2290",
            "3220",
            "3770",
            "9000",
            "4500",
            "2"
        ],
        descImg: descTr5,
        paramLabel: "Топливозаправщик Садко 9 (C41A13) с АТЗ 4,5 м3 двухсекционная",
        parametrs: [
            "ГАЗ C41R13",
            "ЯМЗ-53443, 168,9 л.с.",
            "Механическая, 5-ступенчатая",
            "3770",
            "6530x2290x3220",
            "4500",
            "Эллипс",
            "Постоянное",
            "Наличие",
            "Низколегированная Сталь 09Г2С",
            "3 мм",
            "На стремянках и болтовых соединениях",
            "2",
            "Да, сертификат о калибровке цистерны",
            "Верхним способом",
            "Гравитационный (самотеком), при помощи собственного насоса.",
            "Наличие, по всей длине цистерны",
            "Оборудован шаровыми кранами с выводом в обе стороны в задней части ТС"
        ]
    },
    {
        id: 2,
        title: "АВТОТОПЛИВОЗАПРАВЩИК НА ШАССИ ГАЗ C41R13 (МОДЕЛЬ 4389JY)",
        img: trak12,
        price: "от 6 200 000Р",
        mass: "до 12",
        descKey: [
            "Базовое шасси",
            "Двигатель",
            "КПП",
            "Длина автомобиля, мм",
            "Ширина автомобиля, мм",
            "Высота автомобиля, мм",
            "Колесная база, мм",
            "Полная масса, кг",
            "Объем цистерны, л.",
            "Количество отсеков, шт."
        ],
        descValue: [
            "ГАЗ C41R13",
            "ЯМЗ 53445, 168 л. с.",
            "Механическая, 5-ти ступенчатая",
            "6440",
            "2195",
            "2890",
            "3770",
            "8700",
            "5300",
            "2"
        ],
        paramLabel: "Автотопливозаправщик на шасси ГАЗ C41R13 (модель 4389JY)",
        parametrs: [
            "ГАЗ C41R13",
            "ЯМЗ 53445, 168 л. с.",
            "Механическая, 5-ти ступенчатая",
            "3770",
            "6440x2195x2890",
            "5300",
            "2 шт., ОП-6, расположены в пластиковых пеналах справа и слева по ходу движения ТС, на переднем донце цистерны",
            "1 шт., пластиковый, установлен с левой стороны по ходу движения ТС, в задней части.",
            "1 шт., пластиковый, для массы не менее 25 кг., установлен с левой стороны по ходу движения ТС, в задней части,",
            "2 шт., пластиковые",
            "1 шт.",
            "1 шт., трос длиной 10 м., БЗЗ-10",
            "2 шт. оранжевого цвета",
            
        ]
    },
    ]
  },
  "Aerial-work-platforms": {
    slug: "Aerial-work-platforms",
    title: "Автогидроподъёмники",
    cartImg: cartImg4,
    filters: [
      { 
        type: "search", 
        label: "Марка", 
        options: ["ГАЗ"] 
      },
      { 
        type: "checkbox", 
        label: "Колесная формула", 
        options: ["4x2"] 
      }
    ],
    content: {
      intro: "Машины для работы на высоте становятся всё более технологичными и удобными. Купить автогидроподъемник — выгодное решение для повышения эффективности и безопасности работ. Такая техника обеспечивает точное выполнение задач и минимизирует риски. Компания «РусТрак» предлагает надёжные модели для разных условий эксплуатации. Продуманная конструкция гарантирует устойчивость и точность движения. Дополнительные функции делают управление проще и повышают удобство работы.",
      assortment: "Ассортимент",
      assortmentdesc1: "Компания «РусТрак» предлагает разнообразную технику, где каждая модель АТЗ адаптирована под различные задачи и объёмы работы. В нашем каталоге представлены автомобили ведущих марок:",
      assortmentdesc2: "Вся техника сертифицирована и соответствует строгим стандартам качества, что гарантирует безопасность и долгий срок эксплуатации. Компания соблюдает международные нормы и российские требования, а каждая единица проходит проверку перед поставкой клиенту. Это позволяет клиентам быть уверенными в надежности и эффективности приобретаемого оборудования.",
      brands: ["ГАЗ", "ISUZU", "FUSO", "PALFINGER"],
      featuresLabel: "Особенности автотопливозаправщиков",
      features: [
        {
          featuresLAbel: "Регулируемая высота подъёма",
          featuresdesc: "Позволяет точно поднимать людей и грузы на нужную высоту, повышая безопасность и удобство работы."
        },
        {
          featuresLAbel: "Гидравлическая система управления",
          featuresdesc: "Обеспечивает плавное и точное движение стрелы, снижая риск резких рывков и повреждений.",
        },
        {
          featuresLAbel: "Стабилизационные опоры",
          featuresdesc: "Гарантируют устойчивость техники даже на неровной поверхности, предотвращая опрокидывание.",
        },
        {
          featuresLAbel: "Компактные размеры шасси",
          featuresdesc: "Упрощают маневрирование в ограниченном пространстве и транспортировку оборудования.",
        },
        {
          featuresLAbel: "Эргономичное управление",
          featuresdesc: "Панель управления продумана для удобства оператора, сокращая время обучения и снижая усталость.",
        },
        {
          featuresLAbel: "Надёжная конструкция стрелы и платформы",
          featuresdesc: "Обеспечивает долговечность эксплуатации и высокую устойчивость при работе с грузом.",
        }
      ],
      applicationLabel: "Сферы применения",
      applicationDesc: "Купить автогидроподъемник будет надёжным решением для повышения безопасности и эффективности работ. Такие машины применяются для обслуживания линий электропередач, монтажа и ремонта наружной рекламы, установки освещения и видеонаблюдения, а также для строительных и отделочных работ. Техника востребована в коммунальном хозяйстве, при обслуживании зданий и сооружений, на складах и промышленных объектах. Универсальность и надежность ускоряют процессы, повышают безопасность и снижают трудозатраты. Автогидроподъемники обеспечивают точное и эффективное выполнение задач в любых условиях. Использование такой техники становится оптимальным решением для организаций любого масштаба.",
      workingTitle: "Преимущества работы с компанией «РусТрак»",
      workingfeatures: [
        {
          workingFeaturesLabel: "Широкий ассортимент техники",
          workingFeaturesDesc: "Компания предлагает разнообразные модели автогидроподъемников, подходящие для разных задач и условий эксплуатации.",
        },
        {
          workingFeaturesLabel: "Профессиональная консультация",
          workingFeaturesDesc: "Специалисты помогают выбрать оптимальное оборудование с учётом высоты подъёма, грузоподъёмности и специфики работы.",
        },
        {
          workingFeaturesLabel: "Гарантия качества",
          workingFeaturesDesc: "Все машины проходят проверку и соответствуют стандартам безопасности, что обеспечивает надёжную и долговечную эксплуатацию.",
        },
        {
          workingFeaturesLabel: "Удобство покупки",
          workingFeaturesDesc: "Компания предлагает гибкие условия приобретения, включая доставку и оформление документов, что экономит время клиентов.",
        },
        {
          workingFeaturesLabel: "Поддержка и обслуживание",
          workingFeaturesDesc: "После покупки доступны сервисные услуги и консультации по эксплуатации, что продлевает срок службы техники.",
        },
        {
          workingFeaturesLabel: "Индивидуальный подход",
          workingFeaturesDesc: "Каждому клиенту подбираются решения, учитывающие конкретные задачи и бюджет, что повышает эффективность использования техники.",
        },
      ],
      equipmentTItle: "Техника, которая облегчает работу на высоте",
      equipmentdesc: "Купить автогидроподъемник — шаг к повышению эффективности и безопасности работы. Мы поможем с выбором техники, учитывая ваши задачи и требования. Компания «РусТрак» предоставляет широкий ассортимент моделей и консультации специалистов. Изучите характеристики и подберите подходящую модель. Действуйте активно, чтобы обеспечить удобство и продуктивность работы. Для оформления заказа свяжитесь с нами любым удобным способом, и мы поможем выбрать оптимальное решение.",
    },
    trak: [
      {
        id: 1,
        title: "АВТОГИДРОПОДЪЕМНИК PALFINGER P 180T НА ШАССИ ГАЗ C41R33",
        img: trak13,
        price: "Цена по запросу",
        descKey: [
            "Базовое шасси",
            "Двигатель",
            "КПП",
            "Высота автомобиля, мм",
            "Колесная база, мм",
            "Полная масса, кг",
            "Высота подъема, м",
            "Грузоподъемность люльки, кг"
        ],
        descValue: [
            "ГАЗ C41R33",
            "ЯМЗ-5344 с турбонаддувом",
            "Механическая, 5-ти ступенчатая",
            "3667",
            "4515",
            "8170",
            "18",
            "10,7"
        ],
        paramLabel: "Автогидроподъемник Palfinger P 180T на шасси ГАЗ C41R33",
        parametrs: [
            "4389J7",
            "ГАЗ C41R33",
            "1,4 x 0,85 x 1,1",
            "4515",
            "18,0 (по ГОСТ Р 53037)",
            "10,7",
            "300",
            "+90 -:- -90",
            "4515",
            "18,0 (по ГОСТ Р 53037)",
            "10,7",
            "300",
            "+90 -:- -90",
        ]
    },
    ]
  },
  "Tanker-trucks": {
    slug: "Tanker-trucks",
    title: "Автоцистерны",
    cartImg: cartImg5, 
    filters: [
      { 
        type: "search", 
        label: "Марка", 
        options: ["ГАЗ", "КАМАЗ", "JAC"] 
      },
      { 
        type: "checkbox", 
        label: "Тип автоцистерны", 
        options: ["Вакуумная автоцистерна", "Пищевая автоцистерна"] 
      },
      {
        type: "range",
        label: "Объем цистерны, л."
      }
    ],
    content: {
      intro: "Техника для обслуживания жидких и вязких сред требует точности и продуманного подхода. Вакуумная автоцистерна обеспечивает аккуратное обращение с рабочими средами и поддерживает стабильность технологических операций. Её конструкция направлена на удобное управление и безопасность персонала. Компания «РусТрак» предлагает решения, соответствующие строгим требованиям и особенностям отрасли. Модели отличаются прочностью и способностью сохранять рабочие характеристики при длительной эксплуатации. Такой подход укрепляет доверие к технике и снижает вероятность непредвидённых остановок.",
      assortment: "Ассортимент",
      assortmentdesc1: "Мы предлагаем модели автоцистерн, доступные в разных исполнениях и модификациях. В нашем каталоге представлен большой выбор техники, среди которой каждый сможет найти подходящий вариант для своих нужд.",
      assortmentdesc2: "Тип автоцистерны:",
      assortmentdesc3: "Все модели проходят обязательную сертификацию и соответствуют российским и международным стандартам качества. Это обеспечивает надёжность, безопасность эксплуатации и долговечность техники, а также даёт уверенность в соответствии оборудования заявленным требованиям.",
      brand: "Марка:",
      brands: ["ГАЗ", "КАМАЗ", "JAC", "ISUZU", "HYUNDAI", "HINO"],
      assortmentdesc2features: [
        "Вакуумная автоцистерна",
        "Пищевая автоцистерна",
      ],
      featuresLabel: "Особенности автоцистерн",
      features: [
        {
          featuresdesc: "Создание вакуума – обеспечивает эффективный сбор и транспортировку жидких и вязких веществ без разливов и потерь."
        },
        {
          featuresdesc: "Прочность конструкции – корпус и комплектующие выполнены из материалов, устойчивых к коррозии и механическим нагрузкам.",
        },
        {
          featuresdesc: "Система управления – позволяет точно контролировать процесс закачки и откачки жидкостей, упрощая работу оператора.",
        },
        {
          featuresdesc: "Универсальность применения – техника может использоваться в различных отраслях благодаря адаптируемым параметрам и модификациям.",
        },
        {
          featuresdesc: "Обслуживание и ремонт – продуманная конструкция упрощает доступ к ключевым узлам для профилактики и ремонта.",
        },
        {
          featuresdesc: "Безопасность эксплуатации – встроенные системы защиты предотвращают аварийные ситуации и обеспечивают безопасную работу с опасными средами.",
        }
      ],
      applicationLabel: "Сферы применения",
      applicationDesc: "Автоцистерна вакуумная используется в самых разных сферах, где важны безопасная и эффективная транспортировка и хранение жидких и вязких веществ. Она применяется в промышленности для перемещения технологических жидкостей, в коммунальной сфере для откачки сточных вод и обслуживания городских систем, а также в пищевой отрасли для перевозки жидких продуктов и сырья. Надёжность и прочность конструкции делают её востребованной в строительстве и сельском хозяйстве, где требуется аккуратная работа с жидкостями при различных условиях эксплуатации. Такая автоцистерна помогает оптимизировать процессы, повышает эффективность работы и обеспечивает безопасность персонала.",
      workingTitle: "Преимущества работы с компанией «РусТрак»",
      workingfeatures: [
        {
          workingFeaturesDesc: "Широкий ассортимент техники – в наличии различные модели вакуумных автоцистерн, адаптированные под конкретные задачи и условия эксплуатации.",
        },
        {
          workingFeaturesDesc: "Надёжность оборудования – все автоцистерны проходят строгий контроль качества и обеспечивают безопасную и стабильную работу.",
        },
        {
          workingFeaturesDesc: "Индивидуальный подбор решений – специалисты помогают выбрать модель с оптимальными характеристиками и комплектацией под ваши потребности.",
        },
        {
          workingFeaturesDesc: "Поддержка на всех этапах – консультации при выборе, сопровождение при заказе и техническая поддержка после покупки.",
        },
        {
          workingFeaturesDesc: "Доставка и сервис – компания обеспечивает оперативную поставку и качественное обслуживание техники в Нижнем Новгороде и регионе.",
        },
        {
          workingFeaturesDesc: "Прозрачные условия сотрудничества – честные цены, подробные спецификации и официальная документация для каждого заказа.",
        },
      ],
      equipmentTItle: "Комфорт и безопасность при транспортировке жидкостей",
      equipmentdesc: "Автоцистерна, купить которую не только выгодно, но и удобно, обеспечит надёжную и безопасную работу при транспортировке и хранении различных жидкостей. Выберите модель, соответствующую вашим требованиям и условиям эксплуатации. Компания «РусТрак» готова предоставить консультацию и помочь с подбором техники. Ознакомьтесь с техническими характеристиками и доступными опциями. Сделайте шаг к повышению эффективности и безопасности ваших процессов. Оформите заказ на нашем сайте или свяжитесь с нами любым удобным способом.",
    },
    trak: [
      {
        id: 1,
        title: "ПИЩЕВАЯ ЦИСТЕРНА КАМАЗ 43089",
        img: trak14,
        price: "Цена по запросу",
        descKey: [
            "Базовое шасси",
            "Двигатель",
            "КПП",
            "Длина автомобиля, мм",
            "Ширина автомобиля, мм",
            "Высота автомобиля, мм",
            "Колесная база, мм",
            "Полная масса, кг",
            "Объем цистерны, л.",
            "Количество отсеков, шт.:"
        ],
        descValue: [
            "КАМАЗ 43089",
            "Cummins ISF3.8S5154, 154 л. с.",
            "Механическая, 6-ти ступенчатая",
            "6500",
            "2200",
            "2300",
            "3845",
            "9500",
            "5000",
            "2"
        ],
        paramLabel: "Пищевая цистерна КАМАЗ 43089",
        parametrs: [
            "КАМАЗ 43089",
            "Бортовая платформа с КМУ",
            "Cummins ISF3.8S5154, 154 л. с.",
            "Механическая, 6-ти ступенчатая",
            "3845",
            "6500x2200x2300",
            "9500",
            "5000",
            "эллиптического сечения",
            "есть, объемным методом",
            "2",
            "2, с герметичной крышкой диаметром 500мм.",
            "термоизолированные, с дыхательным клапаном ДУ-50, каждый вентиль люка имеет возможность пломбировки, нарушаемой при попытке открытия люка"
        ]
    },
    {
        id: 2,
        title: "ГАЗОН NEXT С ПИЩЕВОЙ ЦИСТЕРНОЙ 4,2 КУБА",
        img: trak15,
        price: "Цена по запросу",
        descKey: [
            "Базовое шасси",
            "Двигатель",
            "КПП",
            "Длина автомобиля, мм",
            "Ширина автомобиля, мм",
            "Высота автомобиля, мм",
            "Колесная база, мм",
            "Полная масса, кг",
            "Объем цистерны, л.",
            "Количество отсеков, шт.:"
        ],
        descValue: [
            "ГАЗ C41R13",
            "ЯМЗ-53445, 168,9 л.с.",
            "Механическая, 5-ти ступенчатая",
            "8150-9200",
            "9200",
            "3280",
            "4570",
            "8700",
            "4200",
            "2"
        ],
        paramLabel: "Газон NEXT с пищевой цистерной 4,2 куба",
        parametrs: [
            "8700",
            "4,2",
            "чемоданное",
            "2",
            "2 (Ду 50), термоизолированные,",
            "2 (Ду 50), обеспечивают отсечку перевозимой жидкости внутри цистерны",
            "Ручное, сзади из отсека",
            "2 (Ду 50) из нержавеющей стали,",
            "ФРП, толщина 50 мм",
            "Нержавеющая сталь AISI 304",
            "Нержавеющая сталь AISI 304 (зеркальная)",
            "С левой и с правой стороны цистерны из просечно-профилированного настила с поручнями и лестницей.",
            "Есть, объемным методом"
        ]
    },
    ]
  },
  "Tow-trucks": {
    slug: "Tow-trucks",
    title: "Автоэвакуаторы",
    cartImg: cartImg3,
    filters: [
      { 
        type: "search", 
        label: "Марка", 
        options: ["КАМАЗ"] 
      },
      { 
        type: "checkbox", 
        label: "Тип бортовой платформы", 
        options: ["Прямого типа"] 
      },
      { 
        type: "checkbox", 
        label: "Колесная формула", 
        options: ["4x2"] 
      },
      { 
        type: "checkbox", 
        label: "Длина платформы, м", 
        options: ["4600"] 
      }
    ],
    content: {
      intro: "Автомобильная техника развивается стремительными темпами, предлагая водителям новые возможности и удобства. Купить автоэвакуатор становится разумным решением для расширения возможностей бизнеса и повышения мобильности. Сфера перевозки автомобилей требует надежного оборудования и точного планирования. Компания «РусТрак» предлагает специализированную технику, которая отвечает высоким стандартам безопасности. Внедрение современных решений позволяет сократить время выполнения задач и повысить качество обслуживания. Надежное оборудование сочетает функциональность с долговечностью и простотой эксплуатации.",
      assortment: "Ассортимент",
      assortmentdesc1: "В наличии представлена надежная техника, рассчитанная на разные условия эксплуатации и задачи. Модели подбираются с учетом требований к грузоподъемности, маневренности и техническим характеристикам, что обеспечивает удобство и стабильность работы. Доступные варианты на базе:",
      assortmentdesc2: "Каждая позиция отличается качественной сборкой и продуманной конструкцией, что положительно сказывается на сроке службы и удобстве эксплуатации. Такой выбор позволяет подобрать подходящее решение под конкретные условия.",
      brands: ["КАМАЗ", "ISUZU"],
      featuresLabel: "Особенности автоэвакуаторов",
      features: [
        {
          featuresdesc: "Надежность конструкции — эвакуатор для автомобиля рассчитан на интенсивную эксплуатацию и стабильную работу при высоких нагрузках."
        },
        {
          featuresdesc: "Высокая грузоподъемность — позволяет безопасно перевозить различные транспортные средства без снижения эффективности.",
        },
        {
          featuresdesc: "Удобство управления — продуманная компоновка упрощает работу оператора и снижает утомляемость.",
        },
        {
          featuresdesc: "Долговечность узлов и агрегатов — качественные материалы и сборка увеличивают срок службы техники.",
        },
        {
          featuresdesc: "Безопасность при погрузке — технические решения обеспечивают устойчивость и контроль при выполнении работ.",
        },
        {
          featuresdesc: "Универсальность применения — эвакуаторы на шасси КАМАЗ и ISUZU подходят для выполнения разных задач в любых условиях эксплуатации.",
        }
      ],
      applicationLabel: "Сферы применения",
      applicationDesc: "Эвакатор с КМУ широко применяется для перевозки легковых транспортных средств на различные расстояния и для решения сложных задач на дороге. Конструкция и технические возможности обеспечивают безопасную погрузку и стабильное перемещение без риска повреждений, а удобство управления позволяет легко маневрировать даже в плотном городском движении. Эвакуационный автомобиль эффективно используется для эвакуации неисправных автомобилей после поломок и дорожно-транспортных происшествий. Надежность узлов и прочность конструкции позволяют выполнять задачи на трассах и в условиях ограниченного пространства без потери эффективности. Дополнительно возможна эксплуатация при работе с коммерческим транспортом и на площадках с ограниченным пространством. Универсальность конструкции делает такие автомобили подходящими для регулярной и интенсивной эксплуатации в разных условиях.",
      workingTitle: "Преимущества работы с компанией «РусТрак»",
      workingfeatures: [
        {
          workingFeaturesDesc: "Наличие всех необходимых сертификатов — техника соответствует установленным требованиям и нормативам.",
        },
        {
          workingFeaturesDesc: "Контроль качества на каждом этапе — проверка оборудования перед передачей заказчику.",
        },
        {
          workingFeaturesDesc: "Гарантийное и послегарантийное обслуживание — техническая поддержка в процессе эксплуатации.",
        },
        {
          workingFeaturesDesc: "Удобный процесс покупки — сопровождение сделки и помощь с оформлением документов.",
        },
        {
          workingFeaturesDesc: "Практический опыт работы — понимание особенностей техники и условий эксплуатации.",
        },
        {
          workingFeaturesDesc: "Конкурентная цена — возможность приобрести недорогой автоэвакуатор без ущерба для качества.",
        },
        {
          workingFeaturesDesc: "Доверие со стороны клиентов — стабильная работа и подтвержденное качество поставляемой техники."
        }
      ],
      equipmentTItle: "Современные решения для перевозки",
      equipmentdesc: "Купить эвакуатор с КМУ — практичное решение для расширения возможностей транспортировки и облегчения работы на дорогах. Такой транспорт открывает новые горизонты и упрощает выполнение сложных задач. Компания «РусТрак» предлагает проверенную технику с гарантией качества и долгим сроком службы. Позаботьтесь о безопасности и эффективности своих перевозок. Сделайте работу более удобной и надежной с современным оборудованием. Для оформления заказа свяжитесь с нами любым удобным способом, и мы поможем подобрать оптимальное решение.",
    },
    trak: [
      {
        id: 1,
        title: "ЭВАКУАТОР НА ШАССИ КАМАЗ-4308 С КМУ PALFINGER PK 13500T",
        img: trak16,
        price: "Цена по запросу",
        formula: "4x2",
        descKey: [
            "Базовое шасси",
            "Двигатель",
            "КПП",
            "Тип бортовой платформы",
            "Длина автомобиля, мм",
            "Ширина автомобиля, мм",
            "Высота автомобиля, мм",
            "Колесная база, мм",
            "Колесная формула",
            "Длина платформы, м",
            "Полная масса, кг",
            "Грузоподъёмность, кг",
            "Грузоподъёмность КМУ, тонн",
            "Вылет стрелы, м"
        ],
        descValue: [
            "КАМАЗ 4308",
            "Cummins 4 ISB, 185 л.с.",
            "ZF6",
            "Прямого типа",
            "8500",
            "2500",
            "3390",
            "4700",
            "4x2",
            "4600",
            "11450",
            "3100",
            "5,2",
            "8"
        ],
        paramLabel: "Эвакуатор на шасси КАМАЗ-4308 с КМУ Palfinger PK 13500T",
        parametrs: [
            "4388A5-10",
            "8500",
            "2500",
            "3390",
            "4700",
            "4x2",
            "12,1",
            "8,0",
            "1520",
            "5200",
            "5,6",
            "1420",
            "200"
        ]
    },
    ]
  },
  "Insulated-vans": {
    slug: "Insulated-vans",
    title: "Изотермические фургоны", 
    cartImg: cartImg7,
    filters: [
      { 
        type: "search", 
        label: "Brand", 
        options: ["KAMAZ", "JAC", "DAEWOO", "FAW", "DONG FENG", "SHACMAN"] 
      }
    ],
    content: {
      intro: "Транспортировка товаров с соблюдением температурного режима становится всё более востребованной в разных отраслях. Купить изотермический фургон для сохранения качества продукции на протяжении всего пути становится рациональным решением для компаний, стремящихся к оптимизации логистики. Использование специализированных транспортных средств снижает риск порчи и экономит ресурсы. Компания «РусТрак» предлагает широкий выбор моделей с современными технологиями изоляции и контроля температуры. Инвестиции в надежный транспорт повышают эффективность логистических процессов и минимизируют убытки. Надёжность техники напрямую отражается на доверии клиентов и стабильности бизнеса.",
      assortment: "Ассортимент",
      assortmentdesc1: "В компании представлен широкий выбор техники для перевозки различных грузов. Каждый грузовой фургон изотермический способен обеспечить надежную доставку и сохранность продукции. Модели отличаются габаритами, грузоподъемностью и особенностями конструкции, что позволяет подобрать оптимальный вариант для любых перевозок. Среди доступных марок:",
      assortmentdesc2: "Каждая марка отличается надежностью и современными технологиями, обеспечивая сохранность груза на всех этапах транспортировки. Выбор подходящей модели позволяет оптимизировать логистику и повысить эффективность работы компании.",
      brands: ["КАМАЗ", "JAC", "DAEWOO", "FAW", "ISUZU", "HYUNDAI", "HINO", "DONG FENG", "SHACMAN"],
      featuresLabel: "Особенности изотермических фургонов",
      features: [
        {
          featuresdesc: "Сохранение температуры – надежная термоизоляция позволяет поддерживать стабильный температурный режим, предотвращая порчу продукции."
        },
        {
          featuresdesc: "Разнообразие моделей – широкий выбор фургонов разного объема и грузоподъёмности обеспечивает оптимальный вариант для любых задач.",
        },
        {
          featuresdesc: "Надежность техники – проверенные марки и современные технологии снижают риск поломок и обеспечивают долгий срок службы транспорта.",
        },
        {
          featuresdesc: "Экономия ресурсов – уменьшение потерь груза и оптимизация логистики сокращают затраты на перевозку и хранение, при этом фургоны изотермические цены которые остаются доступными для компаний любого масштаба.",
        },
        {
          featuresdesc: "Удобство эксплуатации – продуманная конструкция фургонов облегчает загрузку, разгрузку и обслуживание транспорта.",
        },
        {
          featuresdesc: "Поддержка производителя – наличие сервисных центров и консультаций позволяет быстро решать любые вопросы, связанные с эксплуатацией.",
        }
      ],
      applicationLabel: "Сферы применения",
      applicationDesc: "Изотермические фургоны активно используются в пищевой промышленности для перевозки продуктов, требующих поддержания определённой температуры. Фрукты, овощи, мясо и молочная продукция сохраняют свежесть на протяжении всего пути, что особенно важно для дальних перевозок и дистрибуции в розничные сети. Транспорт с термоизоляцией также незаменим для фармацевтической отрасли. Лекарства, вакцины и другие медицинские препараты требуют строгого соблюдения температурного режима, а изотермический фургон обеспечивает безопасные условия доставки от производителя до конечного потребителя. Кроме того, такие фургоны применяются в химической и косметической промышленности. Продукция, чувствительная к перепадам температуры, сохраняет свои свойства благодаря поддержанию стабильного микроклимата внутри кузова. Использование надёжного транспорта минимизирует риски порчи и повышает эффективность логистических процессов.",
      workingTitle: "Преимущества работы с компанией «РусТрак»",
      workingfeatures: [
        {
          workingFeaturesDesc: "Широкий выбор техники – компания предлагает фургоны разных марок и моделей, что позволяет подобрать оптимальный вариант под любые задачи, при этом новый изотермический фургон цена остаётся конкурентоспособной.",
        },
        {
          workingFeaturesDesc: "Качество и надежность – все транспортные средства соответствуют современным стандартам и проходят проверку перед продажей, обеспечивая долгий срок службы.",
        },
        {
          workingFeaturesDesc: "Профессиональная консультация – специалисты помогают выбрать подходящую модель с учётом особенностей бизнеса и требований к перевозкам.",
        },
        {
          workingFeaturesDesc: "Поддержка и сервис – «РусТрак» обеспечивает сервисное обслуживание, ремонт и поставку запчастей, что снижает риски простоя техники.",
        },
        {
          workingFeaturesDesc: "Индивидуальный подход – компания учитывает потребности каждого клиента, предлагая гибкие условия покупки и дополнительное оборудование.",
        },
        {
          workingFeaturesDesc: "Оптимизация логистики – грамотный подбор техники и сопровождение сделки позволяют повысить эффективность перевозок и сократить расходы.",
        },
      ],
      equipmentTItle: "Оптимальные решения для температурной логистики",
      equipmentdesc: "Купить фургон изотермический цена которого соответствует бюджету и разным задачам — разумное решение для компаний, стремящихся к надежной перевозке товаров. Такой транспорт обеспечивает стабильный температурный режим и минимизирует потери продукции. Компания «РусТрак» помогает подобрать технику с учётом индивидуальных требований и особенностей бизнеса. Оцените доступные варианты и выберите оптимальное решение для своих перевозок. Начните улучшать логистику уже сейчас, повышая эффективность работы и сокращая риски. Для оформления заказа свяжитесь с нами любым удобным способом, и специалисты помогут завершить процесс быстро и удобно.",
    },
    trak: [
      {
        id: 1,
        title: "БОРТОВОЙ АВТОМОБИЛЬ МАЗ 631228",
        img: trak17,
        price: "Цена по запросу",
        descKey: [
            "Базовое шасси",
            "Двигатель",
            "КПП",
            "Длина автомобиля, мм",
            "Ширина автомобиля, мм",
            "Высота автомобиля, мм",
            "Колесная база, мм",
            "Длина платформы, м",
            "Полная масса, кг",
            "Снаряженная масса, кг",
            "Грузоподъёмность, кг"
        ],
        descValue: [
            "МАЗ 631228-8575-012",
            "БМВК12Д6.430Е5, 430 л. с.",
            "Мех. 12J5200TA, 12-ти ступенчатая",
            "10405",
            "2550",
            "3080",
            "4600+1400",
            "7800",
            "33500",
            "11900",
            "21600"
        ],
        paramLabel: "Бортовой автомобиль МАЗ 631228-8575-012",
        parametrs: [
            "10405",
            "2550",
            "3080",
            "7800",
            "2550",
            "600",
            "33500",
            "11900",
            "21600",
            "Сварная рамная конструкция из открытых профилей. Состоит из продольных лонжеронов и поперечных балок, окантовочного и передней стенки профиля HOSSEN. Оцинкованные петли крепления груза в окантовочном профиле платформы (не уменьшают погрузочную ширину платформы), 6 шт. с каждой стороны.",
            "Влагостойкая фанера с противоскользящим покрытием толщиной 18 мм.",
            "Стальные борта, откидывающиеся, количество секций 3 шт. на сторону, высота 600 мм.",
            "Угол открывания бортов – 1800"
        ]
      },
      {
          id: 2,
          title: "БОРТОВОЙ АВТОМОБИЛЬ JAC N90L",
          img: trak18,
          price: "Цена по запросу",
          descKey: [
              "Базовое шасси",
              "Двигатель",
              "КПП",
              "Длина автомобиля, мм",
              "Ширина автомобиля, мм",
              "Высота автомобиля, мм",
              "Колесная база, мм",
              "Длина платформы, м",
              "Полная масса, кг",
              "Снаряженная масса, кг",
              "Грузоподъёмность, кг"
          ],
          descValue: [
              "JAC N90L",
              "Cummins ISF3.8S5154, 154 л. с.",
              "Механическая, 6-ти ступенчатая",
              "8610",
              "2550",
              "2280",
              "3845...5275",
              "5200...7400",
              "9500",
              "4310...4530",
              "5150"
          ],
          paramLabel: "Бортовой автомобиль JAC N90L",
          parametrs: [
              "КАМАЗ 43089-44511-F5",
              "Платформа бортовая",
              "Cummins ISF3.8S5154, 154 л. с.",
              "Механическая, 6-ти ступенчатая",
              "3845...5275",
              "7860...9570",
              "2550",
              "2300",
              "5200...7400",
              "2550",
              "400",
              "9500",
              "4310...4530"
          ]
      },
      {
          id: 3,
          title: "БОРТОВОЙ АВТОМОБИЛЬ КАМАЗ 43082",
          img: trak19,
          price: "Цена по запросу",
          descKey: [
              "Базовое шасси",
              "Двигатель",
              "КПП",
              "Длина автомобиля, мм",
              "Ширина автомобиля, мм",
              "Высота автомобиля, мм",
              "Колесная база, мм",
              "Длина платформы, м",
              "Полная масса, кг",
              "Снаряженная масса, кг",
              "Грузоподъёмность, кг"
          ],
          descValue: [
              "КАМАЗ 43082",
              "Cummins ISF3.8S5168, 168 л. с.",
              "Механическая, 6-ти ступенчатая",
              "8960",
              "2550",
              "3605",
              "4475...6200",
              "6200...8400",
              "11990",
              "5050...5365",
              "5150"
          ],
          paramLabel: "КАМАЗ 43082",
          parametrs: [
              "КАМАЗ 43082",
              "Платформа бортовая",
              "Cummins ISF3.8S5168, 168 л. с.",
              "Механическая, 6-ти ступенчатая",
              "4475...6200",
              "8460...10635",
              "2550",
              "3605",
              "6200...8400",
              "2550",
              "600",
              "11990",
              "5050...5365"
          ]
      },
    ]
  },
  "Container-chassis-trucks": {
    slug: "Container-chassis-trucks",
    title: "Контейнеровозы",
    cartImg: cartImg8,
    filters: [
      { 
        type: "search", 
        label: "Марка", 
        options: ["ГАЗ", "КАМАЗ"] 
      },
      { 
        type: "checkbox", 
        label: "Колесная формула", 
        options: ["4x2", "6x4"] 
      }
    ],
    content: {
      intro: "Транспортировка грузов обеспечивает быструю и надежную доставку между городами и регионами. Купить контейнеровоз для увеличения мобильности и объема перевозок помогает компаниям справляться с большими объемами работы. Компания «РусТрак» предлагает широкий выбор грузовых автомобилей для разных задач и условий работы. Использование современных машин ускоряет доставку и повышает безопасность грузов. Техника для перевозки контейнеров позволяют перевозить разнообразные грузы с высокой эффективностью. Передовые технологии в автомобильной логистике делают перевозки более удобными и надежными.",
      assortment: "Ассортимент",
      assortmentdesc1: "Компания «РусТрак» предлагает разнообразные авто контейнеровозы, подходящие для разных задач и условий эксплуатации. В нашем предложении представлены марки, известные надежностью, высокой грузоподъемностью и актуальными технологиями:",
      assortmentdesc2: "Каждая модель оснащена всем необходимым для безопасной и быстрой транспортировки грузов. Мы уделяем внимание качеству техники и удобству эксплуатации, чтобы перевозки проходили максимально эффективно.",
      brands: ["ГАЗ", "КАМАЗ"],
      featuresLabel: "Особенности контейнеровозов",
      features: [
        {
          featuresdesc: "Высокая грузоподъемность — позволяют перевозить большие объемы грузов за одну поездку, снижая количество рейсов и экономя время."
        },
        {
          featuresdesc: "Надежность конструкции — прочная рама и шасси обеспечивают стабильную работу даже при сложных дорожных условиях.",
        },
        {
          featuresdesc: "Надежность техники – проверенные марки и современные технологии снижают риск поломок и обеспечивают долгий срок службы транспорта.",
        },
        {
          featuresdesc: "Универсальность применения — подходят для перевозки разных типов контейнеров и грузов, что делает их удобными для разнообразных задач.",
        },
        {
          featuresdesc: "Маневренность и мобильность — возможность работы на узких улицах и в городских условиях, где крупная техника менее эффективна.",
        },
        {
          featuresdesc: "Современные технологии и безопасность — передовые тормозные системы, подвеска и электроника повышают безопасность перевозок и комфорт водителя.",
        },
        {
          featuresdesc: "Экономичность эксплуатации — контейнеровоз, цена которого сочетает доступность и эффективность, позволяет сократить расходы на эксплуатацию."
        }
      ],
      applicationLabel: "Сферы применения",
      applicationDesc: "Контейнерные автомобили широко используются для перевозки различных грузов на дальние и средние расстояния. Они идеально подходят для доставки продукции между городами, что особенно важно для компаний, которым требуется оперативная и безопасная транспортировка. Кроме того, такие машины активно применяются на промышленных и строительных площадках, где необходимо перемещать контейнеры с оборудованием или материалами. Надежность шасси и высокая грузоподъемность делают их удобными для работы в условиях повышенной нагрузки. Грузовой автомобиль контейнеровоз также востребован в логистических компаниях и у поставщиков товаров для розничной торговли. Благодаря мобильности и универсальности он позволяет быстро реагировать на изменения в планах доставки и обеспечивать своевременную поставку продукции.",
      workingTitle: "Преимущества работы с компанией «РусТрак»",
      workingfeatures: [
        {
          workingFeaturesDesc: "Надежная техника — все автомобили контейнеровозы проходят строгий контроль качества и проверку перед поставкой, что гарантирует их долгую и стабильную работу.",
        },
        {
          workingFeaturesDesc: "Разнообразие моделей — широкий выбор машин позволяет подобрать контейнеровоз под любые задачи и условия эксплуатации.",
        },
        {
          workingFeaturesDesc: "Профессиональная поддержка — специалисты компании консультируют на каждом этапе, помогая выбрать оптимальное решение для перевозок.",
        },
        {
          workingFeaturesDesc: "Быстрая доставка и сервис — техника поставляется в кратчайшие сроки, а сервисное обслуживание обеспечивает бесперебойную работу.",
        },
        {
          workingFeaturesDesc: "Прозрачные условия сотрудничества — понятные условия покупки, гарантия и сопровождение сделки делают сотрудничество удобным и безопасным.",
        },
      ],
      equipmentTItle: "Современные решения для мобильной логистики",
      equipmentdesc: "Купить авто контейнеровоз — выгодное решение для ускорения и упрощения перевозок грузов. Выбирайте надежные машины для быстрой и безопасной доставки. Компания «РусТрак» предлагает разнообразные контейнеровозы для любых задач. Начните действовать и оптимизируйте логистику перевозок. Используйте технологические решения, чтобы сэкономить время и силы. Для оформления заказа свяжитесь с нами любым удобным способом, и наши специалисты помогут подобрать оптимальное решение.",
    },
    trak: [
      {
        id: 1,
        title: "ИЗОТЕРМИЧЕСКИЙ ФУРГОН КАМАЗ 43082",
        img: trak20,
        price: "Цена по запросу",
        formula: "4x2",
        descKey: [
            "Базовое шасси",
            "Двигатель",
            "КПП",
            "Длина автомобиля, мм",
            "Ширина автомобиля, мм",
            "Высота автомобиля, мм",
            "Колесная база, мм",
            "Полная масса, кг",
            "Снаряженная масса, кг",
            "Грузоподъёмность, кг",
            "Объем фургона, м3",
            "Длина фургона, м"
        ],
        descValue: [
            "КАМАЗ 43082",
            "Cummins ISF3.8S5168, 168 л. с.",
            "Механическая, 6-ступенчатая",
            "8815",
            "2600",
            "3625",
            "4700...6000",
            "11990",
            "5850...6180",
            "6140",
            "39...56",
            "6700...8500"
        ],
        paramLabel: "Изотермический фургон КАМАЗ 43082",
        parametrs: [
            "Изотермический фургон",
            "Cummins ISF3.8S5168, 168 л. с.",
            "Механическая, 6-ступенчатая",
            "8815...10615",
            "2600",
            "3625...3965",
            "4700...6000",
            "5850...6180",
            "11990",
            "6140...5810",
            "39...56",
            "6700...8500",
            "2600"
        ]
    },
    {
        id: 2,
        title: "ИЗОТЕРМИЧЕСКИЙ ФУРГОН JAC 35",
        img: trak21,
        price: "Цена по запросу",
        formula: "4x2",
        descKey: [
            "Базовое шасси",
            "Двигатель",
            "КПП",
            "Длина автомобиля, мм",
            "Ширина автомобиля, мм",
            "Высота автомобиля, мм",
            "Колесная база, мм",
            "Полная масса, кг",
            "Снаряженная масса, кг",
            "Грузоподъёмность, кг",
            "Объем фургона, м3",
            "Длина фургона, м"
        ],
        descValue: [
            "JAC 35",
            "HFC4DB2-1D, 136 л.с.",
            "Механическая, 6-ступенчатая",
            "6208",
            "2040",
            "2890",
            "3140",
            "3500",
            "2650",
            "850",
            "19",
            "4200"
        ],
        paramLabel: "Изотермический фургон JAC 35",
        parametrs: [
            "JAC 35",
            "6208",
            "2040",
            "2890",
            "3500",
            "850",
            "3140",
            "6208",
            "2040",
            "2890",
            "3500",
            "850",
            "3140",
        ]
    },
    ]
  },
  "Hook-lifts": {
    slug: "Hook-lifts",
    title: "Крюковые погрузчики",
    cartImg: cartImg9,
    filters: [
      { 
        type: "checkbox", 
        label: "Wheel formula", 
        options: ["4x2", "6x4"] 
      }
    ],
    content: {
      intro: "Транспортная логистика оказывает значительное влияние на развитие промышленности и торговли. Для эффективной работы портов и складов используют крюковой погрузчик, способный справляться с тяжелыми грузами. Новые технические решения в этой сфере повышают скорость и безопасность операций. Компания «РусТрак» внедряет инновационные подходы, оптимизируя процессы перевозки и хранения. Автоматизация и цифровые системы контроля позволяют снизить человеческий фактор и ускорить обработку грузов. Применение современных механизмов значительно увеличивает производительность и снижает издержки.",
      assortment: "Ассортимент",
      assortmentdesc1: "Мы предлагаем только качественную и сертифицированную технику, которая соответствует всем стандартам безопасности и надежности. Каждая единица оборудования проходит строгий контроль и готова к интенсивной эксплуатации, что гарантирует долгий срок службы и эффективность работы. Среди представленных марок:",
      assortmentdesc2: "Все модели оснащены современными системами управления и проверенными механизмами, что делает их удобными и безопасными в эксплуатации. Выбор техники позволяет подобрать оптимальное решение под любые задачи и условия работы, обеспечивая стабильность и производительность на высоком уровне.",
      brands: ["ISUZU", "HYUNDAI"],
      featuresLabel: "Особенности крюковых погрузчиков",
      features: [
        {
          featuresdesc: "Мощные подъемные механизмы – крюковые мультилифты позволяют легко справляться с тяжелыми и крупногабаритными грузами."
        },
        {
          featuresdesc: "Надёжная конструкция шасси – обеспечивает стабильность и долговечность даже при интенсивной эксплуатации.",
        },
        {
          featuresdesc: "Гибкость и маневренность – техника легко работает в ограниченном пространстве, на узких складах и стройплощадках.",
        },
        {
          featuresdesc: "Система автоматической защиты – предотвращает перегрузку и защищает механизмы от поломок.",
        },
        {
          featuresdesc: "Энергоэффективность – оптимизированный расход топлива снижает эксплуатационные затраты.",
        },
        {
          featuresdesc: "Удобство обслуживания – простая конструкция узлов и лёгкий доступ к сервисным точкам ускоряют ремонт и техобслуживание.",
        },
        {
          featuresdesc: "Адаптивность к условиям работы – техника готова к эксплуатации при разных климатических и дорожных условиях."
        }
      ],
      applicationLabel: "Сферы применения",
      applicationDesc: "Погрузчик с крюком активно используется в портах и на терминалах для быстрой погрузки и разгрузки контейнеров и крупногабаритных грузов. Техника позволяет эффективно перемещать тяжелые материалы между складами и транспортными средствами, ускоряя обработку грузов и снижая нагрузку на персонал. На строительных площадках такие машины помогают транспортировать строительные блоки, металлоконструкции и другие тяжёлые материалы, обеспечивая точность и безопасность при подъёме и перемещении. Их универсальность позволяет работать в ограниченном пространстве и на неровной местности, что особенно важно для крупных объектов и многоэтажного строительства. В промышленности техника применяется для перемещения сырья, готовой продукции и крупногабаритного оборудования внутри производственных цехов и складских помещений. Использование современных механизмов повышает скорость операций и минимизирует риск повреждения грузов, что делает логистические процессы более стабильными и предсказуемыми.",
      workingTitle: "Преимущества работы с компанией «РусТрак»",
      workingfeatures: [
        {
          workingFeaturesDesc: "Широкий выбор техники – компания предлагает разнообразные модели погрузчиков и специализированного оборудования, что позволяет подобрать решение под любые задачи.",
        },
        {
          workingFeaturesDesc: "Качественная сертифицированная техника – крюковой погрузчик проходит строгий контроль качества и полностью соответствует стандартам безопасности и надежности.",
        },
        {
          workingFeaturesDesc: "Профессиональная поддержка – специалисты компании готовы помочь с выбором, настройкой и эксплуатацией оборудования.",
        },
        {
          workingFeaturesDesc: "Сервисное обслуживание и запчасти – оперативный ремонт и наличие оригинальных запчастей минимизируют простои техники.",
        },
        {
          workingFeaturesDesc: "Индивидуальные решения – компания подбирает технику и условия работы с учетом особенностей бизнеса каждого клиента.",
        },
        {
          workingFeaturesDesc: "Опыт и репутация – «РусТрак» имеет многолетний опыт на рынке и зарекомендовал себя как надежный партнер в сфере транспортной логистики.",
        },
        {
          workingFeaturesDesc: "Оптимизация затрат – выгодные условия поставки и обслуживания помогают снизить расходы на эксплуатацию оборудования."
        }
      ],
      equipmentTItle: "Надёжные решения для грузоперевозок",
      equipmentdesc: "Погрузчик с крюком демонстрирует высокую эффективность при работе с тяжелыми грузами и ускоряет логистические процессы. Инвестиции в современную технику помогают повысить производительность и снизить затраты. Компания «РусТрак» предлагает широкий спектр решений для транспортной логистики и обслуживания оборудования. Оцените возможности автоматизации и внедрите новые технологии в свой бизнес. Следите за обновлениями и совершенствуйте процессы хранения и перевозки грузов. Для оформления заказа свяжитесь с нами любым удобным способом, и наши специалисты помогут подобрать оптимальное решение.",
    },
    trak: [
      {
        id: 1,
        title: "КОНТЕЙНЕРОВОЗ НА ШАССИ КАМАЗ 65115",
        img: trak22,
        price: "Цена по запросу",
        formula: "4x2",
        descKey: [
            "Базовое шасси",
            "Двигатель",
            "КПП",
            "Длина автомобиля, мм",
            "Ширина автомобиля, мм",
            "Высота автомобиля, мм",
            "Колесная база, мм",
            "Колесная формула",
            "Полная масса, кг",
            "Снаряженная масса, кг",
            "Грузоподъёмность, кг"
        ],
        descValue: [
            "КАМАЗ 65115",
            "КАМАЗ 740.705-300 или Cummins ISB6.7E5 300 (E-5), 300 л.",
            "ZF 9S1310 TO или КАМАЗ 154, мех.",
            "8300",
            "2550",
            "2840",
            "3690+1320",
            "6x4",
            "25200",
            "7900",
            "17300"
        ],
        paramLabel: "Контейнеровоз на шасси КАМАЗ 65115",
        parametrs: [
            "КАМАЗ 65115",
            "Контейнеровоз",
            "КАМАЗ 740.705-300 или Cummins ISB6.7E5 300 (E-5), 300 л. с.",
            "11,76 или 6,7",
            "300 / 2200",
            "ZF 9S1310 TO или КАМАЗ 154, механическая",
            "9 или 10 ступенчатая",
            "3690+1320",
            "17300",
            "7900",
            "25200",
            "6200",
            "19000"
        ]
    },
    ]
  },
  "Dump-trucks": {  
    slug: "Dump-trucks",  
    title: "Самосвалы",
    cartImg: cartImg4,
    filters: [
      { 
        type: "search", 
        label: "Марка", 
        options: ["КАМАЗ", "JAC"] 
      },
      { 
        type: "checkbox", 
        label: "Колесная формула", 
        options: ["4x2"] 
      },
      { 
        type: "checkbox", 
        label: "Длина платформы, м", 
        options: ["4600", "5000", "5200", "6500"] 
      }
    ],
    content: {
      intro: "Грузовые перевозки являются важным элементом экономического развития и промышленной логистики. Решение купить новый самосвал позволяет повысить эффективность перевозки материалов и сократить расходы на обслуживание машин. При выборе подходящей модели мы всегда поможем подобрать автомобиль для работы в различных дорожных условиях. Компания «РусТрак» предлагает разнообразные модели с современными техническими характеристиками. Надёжные машины поддерживают стабильную перевозку грузов на производственные площадки. Обновление парка позволяет выполнять более сложные задачи и увеличивать объём перевозок.",
      assortment: "Ассортимент",
      assortmentdesc1: "Компания «РусТрак» предлагает технику для перевозки сыпучих и строительных материалов. Каталог самосвалов объединяет модели различной грузоподъёмности и конфигурации для работы в разных условиях эксплуатации. Доступные варианты шасси:",
      assortmentdesc2: "Модели отличаются техническими характеристиками и возможностями для выполнения различных задач. Такой подход обеспечивает безопасную и эффективную транспортировку грузов, объединяя надёжность оборудования с практичностью использования.",
      brands: ["КАМАЗ", "JAC", "ГАЗ", "ВАЛДАЙ", "ВАЛДАЙ", "КОМПАС", "DONG FENG", "SOLLERS"],
      featuresLabel: "Особенности крюковых погрузчиков",
      features: [
        {
          featuresdesc: "Разная грузоподъёмность – позволяет перевозить как небольшие, так и крупные объёмы сыпучих материалов, подбирая модель под конкретные задачи."
        },
        {
          featuresdesc: "Адаптация к дорожным условиям – техника легко справляется с грунтовыми, городскими и строительными дорогами.",
        },
        {
          featuresdesc: "Разнообразие конфигураций кузова – возможность выбрать машину с оптимальной платформой для специфических грузов делает решение купить самосвал более точным под задачи.",
        },
        {
          featuresdesc: "Экономичное расходование топлива – современные двигатели снижают затраты на эксплуатацию при интенсивной работе.",
        },
        {
          featuresdesc: "Надёжность и долговечность – прочные шасси и качественные комплектующие обеспечивают долгий срок службы техники.",
        },
        {
          featuresdesc: "Простота обслуживания – доступные запчасти и удобная конструкция облегчают техническое обслуживание и ремонт.",
        },
      ],
      applicationLabel: "Сферы применения",
      applicationDesc: "Купить авто самосвал актуально для строительства, где техника используется для перевозки сыпучих материалов, щебня и грунта на строительные площадки. Она обеспечивает быструю и эффективную доставку грузов, сокращая время на логистику. В городских условиях такой транспорт перевозит строительные и бытовые отходы, участвует в расчистке территорий после снегопадов и доставке материалов для благоустройства улиц и дворов. Машины справляются с различными дорожными условиями и задачами. В сельской и лесной отрасли самосвалы перевозят урожай, корм, древесину и удобрения, обеспечивая надёжную доставку грузов на большие расстояния. На промышленных и логистических объектах автомобили применяются для перемещения материалов между площадками, повышая эффективность работы.",
      workingTitle: "Преимущества работы с компанией «РусТрак»",
      workingfeatures: [
        {
          workingFeaturesDesc: "Широкий выбор техники – каталог самосвалов включает модели различной грузоподъёмности и конфигурации, подходящие для любых задач и условий эксплуатации.",
        },
        {
          workingFeaturesDesc: "Консультации и подбор – специалисты помогают выбрать самосвал с учётом конкретных требований и условий работы.",
        },
        {
          workingFeaturesDesc: "Гарантия качества – компания предлагает только проверенные модели с надёжными шасси и комплектующими.",
        },
        {
          workingFeaturesDesc: "Выгодные условия покупки – специалисты предоставляют полную информацию о покупке и помогают рассчитать стоимость грузового самосвала для каждой модели.",
        },
        {
          workingFeaturesDesc: "Оперативная доставка – техника поставляется в кратчайшие сроки, обеспечивая бесперебойную работу предприятий.",
        },
        {
          workingFeaturesDesc: "Опыт и репутация – многолетний опыт позволяет решать задачи любой сложности и поддерживать доверие клиентов.",
        },
      ],
      equipmentTItle: "Надёжная техника для любых условий",
      equipmentdesc: "Купить новый самосвал цена которого выгодна, позволит повысить эффективность перевозки грузов и сократить затраты. Машины обеспечивают стабильную эксплуатацию в разных условиях и подходят для самых разнообразных задач. Компания «РусТрак» предлагает модели с различной грузоподъёмностью и конфигурацией. Ознакомьтесь с каталогом и выберите подходящую технику для своих нужд. Наши специалисты помогут подобрать оптимальный вариант и ответят на все вопросы по поставке и эксплуатации. Для оформления заказа свяжитесь с нами любым удобным способом и обеспечьте стабильную работу своих проектов.",
    },
    trak: [
      {
        id: 1,
        title: "САМОСВАЛ НА ШАССИ КОМПАС 9",
        img: trak24,
        price: "Цена по запросу",
        descKey: [
            "Базовое шасси",
            "Двигатель",
            "КПП",
            "Длина автомобиля, мм",
            "Ширина автомобиля, мм",
            "Высота автомобиля, мм",
            "Колесная база, мм",
            "Колесная формула",
            "Длина платформы, м",
            "Полная масса, кг",
            "Снаряженная масса, кг",
            "Грузоподъёмность, кг",
            "Объем кузова, м3",
            "Высота бортов, мм"
        ],
        descValue: [
            "КОМПАС 9",
            "Cummins ISF3.8S5154, 154 л. с.",
            "Механическая, 6-ти ступенчатая",
            "6670",
            "2550",
            "2310",
            "3845",
            "4x2",
            "4600",
            "9500",
            "4900",
            "4600",
            "12",
            "1300"
        ],
        paramLabel: "Самосвал на шасси КОМПАС 9",
        parametrs: [
            "КОМПАС 9",
            "Самосвальная бортовая платформа, прямоугольного сечения",
            "Cummins ISF3.8S5154, 154 л. с.",
            "Механическая, 6-ти ступенчатая",
            "3845",
            "4x2",
            "4900",
            "9500",
            "4600",
            "Низколегированная Сталь 09Г2С",
            "Состоит из продольных и поперечных балок, боковых, передней и задней обвязок, опорных шарниров для подъема кузова. Толщина днища – 3 мм,",
            "С верхней навеской, толщина панелей бортов – 2 мм.",
            "Назад или трехсторонняя"
        ]
    },
    {
        id: 2,
        title: "САМОСВАЛ-ЗЕРНОВОЗ НА ШАССИ КАМАЗ 6520-3072-53 (МОДЕЛЬ 4388G6)",
        img: trak25,
        price: "Цена по запросу",
        formula: "4x2",
        descKey: [
            "Базовое шасси",
            "Двигатель",
            "КПП",
            "Длина автомобиля, мм",
            "Ширина автомобиля, мм",
            "Высота автомобиля, мм",
            "Колесная база, мм",
            "Колесная формула",
            "Длина платформы, м",
            "Полная масса, кг",
            "Снаряженная масса, кг",
            "Грузоподъёмность, кг",
            "Высота бортов, мм"
        ],
        descValue: [
            "КАМАЗ 6520-3072-53",
            "КАМАЗ 6520-3072-53",
            "Механическая, 16-ти ступенчатая",
            "10660",
            "2550",
            "2265",
            "4600",
            "4x2",
            "6500",
            "33100",
            "15025",
            "18075",
            "2000"
        ],
        paramLabel: "Самосвал-зерновоз на шасси КАМАЗ 6520-3072-53 (модель 4388G6)",
        parametrs: [
            "КАМАЗ 6520-3072-53",
            "Самосвальная бортовая платформа, прямоугольного сечения",
            "КАМАЗ 6520-3072-53",
            "Механическая, 16-ти ступенчатая",
            "4600",
            "4x2",
            "15025",
            "33100",
            "18075",
            "Низколегированная Сталь 09Г2С",
            "Состоит из продольных и поперечных балок, боковых, передней и задней обвязок, опорных шарниров для подъема кузова. Толщина днища – 3 мм.",
            "Передний, задний, правый борта глухие. Левый: верхняя часть (1100 мм) глухая, нижняя часть (900 мм) с нижней навеской, подъём-опускание гидроцилиндром. Толщина панелей бортов – 2 мм. Балкон на заднем борту, полог."
        ]
    },
    ]
  },
  "ADR-EXII-category-trucks": {
    slug: "ADR-EXII-category-trucks",
    title: "Автомобили ДОПОГ категория EXII", 
    cartImg: cartImg11,
    filters: [
      { 
        type: "search", 
        label: "Марка", 
        options: ["КАМАЗ", "JAC"] 
      },
      { 
        type: "checkbox", 
        label: "Колесная формула", 
        options: ["4x2"] 
      },
      { 
        type: "checkbox", 
        label: "Длина платформы, м", 
        options: ["4600", "5000", "5200", "6500"] 
      }
    ],
    trak: [
      {
        id: 1,
        title: "ШТОРНЫЙ ГРУЗОВИК КАМАЗ 4308 ДОПОГ EXII (МОДЕЛЬ 4388H2-10)",
        img: trak26,
        price: "Цена по запросу",
        formula: "4x2",
        descKey: [
            "Базовое шасси",
            "Двигатель",
            "КПП",
            "Длина автомобиля, мм",
            "Ширина автомобиля, мм",
            "Высота автомобиля, мм",
            "Колесная база, мм",
            "Колесная формула",
            "Длина платформы, м",
            "Полная масса, кг",
            "Снаряженная масса, кг",
            "Грузоподъёмность, кг"
        ],
        descValue: [
            "КАМАЗ 4308-3083-69(G5)",
            "Cummins ISB6.7 E5 250, 250 л. с.",
            "Механическая, 9-ступенчатая",
            "8970",
            "2550",
            "3580",
            "4700",
            "4x2",
            "6,6",
            "11980",
            "7350",
            "4630"
        ],
        paramLabel: "Шторный грузовик КАМАЗ 4308 ДОПОГ EXII (модель 4388H2-10)",
        parametrs: [
            "МАЗ 631228-524-010",
            "WP12.430E50, 430 л.с.",
            "Механическая, 16-ти ступенчатая ZF 16S2520TO",
            "4600+1400",
            "7500x2550x2690",
            "Сварная рамная конструкция из открытых профилей. Состоит из продольных лонжеронов и поперечных балок, окантовочного и передней стенки профиля HOSSEN. Оцинкованные петли крепления груза в окантовочном профиле платформы (не уменьшают погрузочную ширину платформы), 7 шт. с каждой стороны.",
            "Влагостойкая фанера с противоскользящим покрытием.",
            "Алюминиевые или стальные оцинкованные борта, откидывающиеся, количество секций – 2 шт. на сторону, высота 600 мм. Угол открывания бортов – 180°. Быстросъёмные стойки 1 шт. на сторону с алюминиевыми замками.",
            "Выполнена из алюминиевого профиля на всю высоту надстройки",
            "Стальной, высотой 2700 мм. Механизм раздельного сдвижения тента с алюминиевыми направляющими на роликах: крыша, боковые стороны. Крюк-багор для сдвижения крыши с кронштейном крепления на правой задней стойке каркаса. Обрешетка из доски в три ряда. Съемная поперечина крыши над воротами, позволяет осуществлять загрузку без ограничений по высоте. Водоотводящий алюминиевый козырек над задними воротами. Задние и передние стойки оцинкованные.",
            "Распашные ворота каркасного типа из наборного алюминиевого профиля со скрытой фурнитурой из нержавеющей стали, по 2 штанги на дверь, по 4 петли на дверь. С возможностью фиксации в открытом положении.",
            "Тент из ткани, удельный вес 650 г/м2. Усиление тента крыши на углах. Натяжители тента в горизонтальном направлении (трещотка) сзади с обеих сторон. Натяжители тента в вертикальном направлении (натяжной замок со стропом и крюком) шаг 0,6м. Съемная передняя штанга боковой шторы для облегченного движения шторы назад.",
            "Пластиковые крылья, брызговики. Боковые влагозащитные габаритные огни. Боковая защита от базового шасси. Заднее защитное устройство. Оцинкованная выдвижная лестница. Поручень для подъёма на платформу."
        ]
    },
    {
        id: 2,
        title: "БОРТОВОЙ АВТОМОБИЛЬ КАМАЗ 4308-3083-69, ДОПОГ КАТЕГОРИЯ EX II (МОДЕЛЬ 4388H2-10)",
        img: trak27,
        price: "Цена по запросу",
        descKey: [
            "Базовое шасси",
            "Двигатель",
            "КПП",
            "Длина автомобиля, мм",
            "Ширина автомобиля, мм",
            "Высота автомобиля, мм",
            "Колесная база, мм",
            "Длина платформы, м",
            "Полная масса, кг",
            "Снаряженная масса, кг",
            "Грузоподъёмность, кг",
            "Объем фургона, м3",
            "Объем кузова, м3"
        ],
        descValue: [
            "МАЗ 631228-524-010",
            "WP12.430E50, 430 л.с.",
            "Мех., 16-ти ступ. ZF 16S2520TO",
            "10070",
            "2550",
            "3990",
            "4600+1400",
            "7500",
            "26500",
            "12700",
            "13800",
            "48",
            "48.9"
        ],
        paramLabel: "Бортовой автомобиль КАМАЗ 4308-3083-69, ДОПОГ категория EX II (модель 4388H2-10)",
        parametrs: [
            "МАЗ 631228-524-010",
            "WP12.430E50, 430 л.с.",
            "Механическая, 16-ти ступенчатая ZF 16S2520TO",
            "4600+1400",
            "7500x2550x2690",
            "Сварная рамная конструкция из открытых профилей. Состоит из продольных лонжеронов и поперечных балок, окантовочного и передней стенки профиля HOSSEN. Оцинкованные петли крепления груза в окантовочном профиле платформы (не уменьшают погрузочную ширину платформы), 7 шт. с каждой стороны.",
            "Влагостойкая фанера с противоскользящим покрытием.",
            "Алюминиевые или стальные оцинкованные борта, откидывающиеся, количество секций – 2 шт. на сторону, высота 600 мм. Угол открывания бортов – 180°. Быстросъёмные стойки 1 шт. на сторону с алюминиевыми замками.",
            "Выполнена из алюминиевого профиля на всю высоту надстройки",
            "Стальной, высотой 2700 мм. Механизм раздельного сдвижения тента с алюминиевыми направляющими на роликах: крыша, боковые стороны. Крюк-багор для сдвижения крыши с кронштейном крепления на правой задней стойке каркаса. Обрешетка из доски в три ряда. Съемная поперечина крыши над воротами, позволяет осуществлять загрузку без ограничений по высоте. Водоотводящий алюминиевый козырек над задними воротами. Задние и передние стойки оцинкованные.",
            "Распашные ворота каркасного типа из наборного алюминиевого профиля со скрытой фурнитурой из нержавеющей стали, по 2 штанги на дверь, по 4 петли на дверь. С возможностью фиксации в открытом положении.",
            "Тент из ткани, удельный вес 650 г/м2. Усиление тента крыши на углах. Натяжители тента в горизонтальном направлении (трещотка) сзади с обеих сторон. Натяжители тента в вертикальном направлении (натяжной замок со стропом и крюком) шаг 0,6м. Съемная передняя штанга боковой шторы для облегченного движения шторы назад.",
            "Пластиковые крылья, брызговики. Боковые влагозащитные габаритные огни. Боковая защита от базового шасси. Заднее защитное устройство. Оцинкованная выдвижная лестница. Поручень для подъёма на платформу."
        ]
    }
    ]
  },
};